Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v7.0.ino
// ============================================================================
//  Zegar NTP RLCD v7.0 — dokladnosc + bateria + niezawodnosc
//   Zmiany v7.0:
//   [DOKLADNOSC — cel: dryf < 1 s/dobe]
//    - autokalibracja offsetu RTC (ENABLE_RTC_AUTOTRIM): pomiar dryftu na
//      granicy sekundy PCF85063A (rozdzielczosc ~ms zamiast 1 s), po kazdym
//      wiarygodnym oknie NTP->NTP (>= 6 h) automatyczna korekta rejestru 0x02;
//      offset trwale w NVS ("rtcOffLsb"), RTC_OFFSET_VALUE to tylko start,
//    - kotwiczenie czasu z RTC w POLOWIE sekundy (+0.5 s): sredni blad fazy
//      zegara systemowego po wybudzeniu spada z ~0.5 s do ~0.25 s,
//   [BATERIA]
//    - CPU w dzien 80 MHz (bylo 160; SPI/I2C/WiFi taktowane z APB 80 MHz,
//      wiec bez wplywu na peryferia); 160 MHz tylko na czas audio (MP3),
//    - NTP konczy probe 8 s po zerwaniu WiFi zamiast czekac 50 s z radiem,
//   [NIEZAWODNOSC]
//    - odblokowanie zawieszonej szyny I2C (9x SCL + STOP) przy bledzie sesji
//      RTC — slave trzymajacy SDA po resecie w polowie transakcji,
//    - retry z backoffem takze po nieudanej RECZNEJ synchronizacji bez czasu,
//   [PORZADKI] WebManager::redirectHome() (dedup 6x), komentarze.
//  Pozostale inwarianty czasu/energii/RTC/sleep przeniesione bez zmian.
//
//  Sprzet: Waveshare ESP32-S3-RLCD-4.2 (ST7305 refleksyjny 400x300 landscape,
//          ES8311 audio codec, PCF85063A RTC). Zasilanie: 1x Samsung INR18650-35E.
//  Arduino IDE: plytka "ESP32S3 Dev Module", Flash 8MB, partycja "8M with spiffs".
//  Pliki obok .ino: photo_font.h  (+ MP3 budzikow na partycji danych: /alarm1..3.mp3)
//  Biblioteki: U8g2 (>=2.35), ESP32 core 3.x, ESP32-audioI2S 3.4.5.
// ============================================================================

#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <Preferences.h>
#include <Wire.h>
#include <atomic>
#include <ctype.h>
#include <limits.h>
#include <time.h>
#include <sys/time.h>
#include <FS.h>
#include <SPIFFS.h>
#include <LittleFS.h>
#include <FFat.h>
#include <U8g2lib.h>
#include <SPI.h>
#include <Audio.h>
#include <esp_adc/adc_oneshot.h>
#include <esp_adc/adc_cali.h>
#include <esp_adc/adc_cali_scheme.h>
#include <esp_sleep.h>
#include <driver/gpio.h>
#include <driver/rtc_io.h>
#include "esp_sntp.h"
#include "esp_task_wdt.h"
#include "esp_system.h"

#include "photo_font.h"

// Deklaracje wyprzedzajace struktur uzywanych w sygnaturach WOLNYCH funkcji przed
// ich definicja. Arduino auto-generuje prototypy tych funkcji i wstawia je na
// gorze pliku (przed definicja struktury) -> bez tego "DrainState not declared".
struct DrainState;

// ============================================================================
//  [0] WERSJA, BUILD INFO, FLAGI FUNKCJI
// ============================================================================
#define FW_NAME        "Zegar NTP RLCD"
#define FW_VERSION     "7.0"
#define FW_BUILD_DATE  __DATE__
#define FW_BUILD_TIME  __TIME__

// 1=wlaczone, 0=wylaczone (#if usuwa kod z kompilacji -> zero narzutu gdy off).
#define ENABLE_WATCHDOG            1   // sprzetowy reset po zawieszeniu petli (TWDT)
#define ENABLE_LOW_BATTERY_PROTECT 1   // ochrona ogniwa: degradacja + ochronny sen
#define ENABLE_DIAGNOSTICS         1   // strona /info + liczniki resetow
#define ENABLE_RTC_AUTOTRIM        1   // automatyczna kalibracja offsetu RTC z pomiaru NTP

// ============================================================================
//  Watchdog zadania (TWDT). Timeout > najdluzszy light-sleep dzienny (60 s).
//  Deep-sleep RESETUJE chip -> TWDT startuje od nowa w setup().
// ============================================================================
constexpr uint32_t WDT_TIMEOUT_S = 90;

static inline void watchdogSetup() {
#if ENABLE_WATCHDOG
  #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    esp_task_wdt_config_t cfg = {};
    cfg.timeout_ms     = WDT_TIMEOUT_S * 1000U;
    cfg.idle_core_mask = 0;        // nie nadzoruj IDLE (sny sa celowe) — tylko loopTask
    cfg.trigger_panic  = true;     // timeout -> panic -> reset (odzysk bez nadzoru)
    if (esp_task_wdt_init(&cfg) == ESP_ERR_INVALID_STATE) {
      esp_task_wdt_reconfigure(&cfg);
    }
  #else
    esp_task_wdt_init(WDT_TIMEOUT_S, true);
  #endif
  esp_task_wdt_add(NULL);
  esp_task_wdt_reset();
#endif
}

static inline void watchdogFeed() {
#if ENABLE_WATCHDOG
  esp_task_wdt_reset();
#endif
}

// Detektor brownout sprzetowy (~2.51 V) CELOWO zostaje WLACZONY (chroni FLASH przy
// zalamaniu napiecia). Programowa ochrona ogniwa usypia juz przy ~3.05 V.

// ============================================================================
//  power_runtime — estymator zuzycia baterii (czysta arytmetyka na probkach SoC).
// ============================================================================
#ifndef DRAIN_CAP_MAH
#define DRAIN_CAP_MAH        3400
#endif
#define DRAIN_CHARGE_HYST    5         // wzrost SoC% liczony jako "doladowano" -> reset kotwicy
#define DRAIN_MIN_WINDOW_SEC 43200     // min. 12 h danych (plaskie plateau Li-ion = szum ADC)
#define DRAIN_MIN_DSOC       2         // min. spadek SoC%, by estymata miala sens

struct DrainState {
  bool     valid;
  int64_t  anchorEpoch;
  uint8_t  anchorSoc;
  int64_t  lastEpoch;
  uint8_t  lastSoc;
};

static inline void drainReset(DrainState &d, int64_t epoch, uint8_t soc) {
  d.valid = true;
  d.anchorEpoch = epoch; d.anchorSoc = soc;
  d.lastEpoch   = epoch; d.lastSoc   = soc;
}

static inline void drainOnSample(DrainState &d, int64_t epoch, uint8_t soc) {
  if (!d.valid) { drainReset(d, epoch, soc); return; }
  if (soc > d.anchorSoc + DRAIN_CHARGE_HYST || soc > d.lastSoc + DRAIN_CHARGE_HYST) {
    drainReset(d, epoch, soc); return;   // wykryto ladowanie -> restart okna
  }
  d.lastEpoch = epoch; d.lastSoc = soc;
}

// mAh/dobe. <0 => za malo danych; 0 => brak mierzalnego zuzycia.
static inline float drainMahPerDay(const DrainState &d) {
  if (!d.valid) return -1.0f;
  int64_t dt = d.lastEpoch - d.anchorEpoch;
  if (dt < DRAIN_MIN_WINDOW_SEC) return -1.0f;
  int dSoc = (int)d.anchorSoc - (int)d.lastSoc;
  if (dSoc < DRAIN_MIN_DSOC) return 0.0f;
  return (dSoc / 100.0f) * (float)DRAIN_CAP_MAH / (dt / 86400.0f);
}

// Dni do rozladowania przy biezacym tempie. <0 => nieznane.
static inline float drainDaysRemaining(const DrainState &d, uint8_t curSoc) {
  float perDay = drainMahPerDay(d);
  if (perDay <= 0.0f) return -1.0f;
  return (curSoc / 100.0f) * (float)DRAIN_CAP_MAH / perDay;
}

// ============================================================================
//  [1] KONFIGURACJA — adresy I2C, kalibracja RTC, piny, stale, TZ, serwery, WiFi
// ============================================================================
#define ES8311_ADDR        0x18
#define PCF85063A_ADDR     0x51
#define RTC_FORMAT_MARKER  0xA5

// --- Kalibracja dryftu krysztalu RTC (rejestr Offset 0x02 PCF85063A) ---------
//   offset DODATNI spowalnia zegar; UJEMNY przyspiesza. Offset[LSB]=blad_ppm/4.34.
//   Zmierzony surowy dryft -2 s/24h -> -5 LSB = -21.7 ppm. 0x7B = -5 LSB, MODE=0.
//   RTC_OFFSET_VALUE to wartosc STARTOWA (fabryczna); z ENABLE_RTC_AUTOTRIM biezacy
//   offset zyje w NVS ("rtcOffLsb") i jest korygowany automatycznie z pomiarow NTP.
#define RTC_OFFSET_REG            0x02
#define RTC_OFFSET_VALUE          0x7B    // -5 LSB, MODE=0 (-21.7 ppm; przyspiesza zegar)
#define RTC_OFFSET_LSB_PPM_MODE0  4.34f
#define RTC_OFFSET_LSB_PPM_MODE1  4.069f
#define RTC_OFFSET_RETRIES        4
#define PPM_SEC_PER_DAY           0.0864f

