Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v7.0.ino
#if ENABLE_RTC_AUTOTRIM
// Pomiar fazowy (granica sekundy RTC vs czas NTP) ma rozdzielczosc ~ms, wiec juz
// jedno okno 6 h daje ppm z niepewnoscia ~0.1 ppm — wystarcza do korekty o 1 LSB
// (4.34 ppm). Kwantyzacja rejestru ogranicza dryf resztkowy do ~±2.2 ppm,
// czyli ~±0.19 s/dobe — ponizej celu 1 s/dobe.
constexpr int64_t AUTOTRIM_MIN_WINDOW_SEC    = 6 * 3600;    // min. okno NTP->NTP
constexpr int64_t AUTOTRIM_MAX_WINDOW_SEC    = 7 * 86400;   // dluzsze = watpliwa kotwica
constexpr float   AUTOTRIM_MAX_PLAUSIBLE_PPM = 150.0f;      // wiecej = bledny pomiar, nie kalibruj
constexpr uint32_t RTC_BOUNDARY_POLL_TIMEOUT_MS = 1300;     // >1 s: przewrot MUSI nadejsc
#endif

// --- Piny: wyswietlacz RLCD (HARDWARE SPI; SPI.begin w DisplayManager::setup) -
#define RLCD_SCK_PIN   11
#define RLCD_MOSI_PIN  12
#define RLCD_DC_PIN    5
#define RLCD_CS_PIN    40
#define RLCD_RST_PIN   41
#define LCD_WIDTH      400
#define LCD_HEIGHT     300

// --- Piny: I2C (kodek + RTC), audio I2S, przyciski, akumulator ----------------
#define I2C_SDA_PIN    13
#define I2C_SCL_PIN    14
#define RTC_INT_PIN    15

#define I2S_MCLK_PIN   16
#define I2S_BCLK_PIN   9
#define I2S_WS_PIN     45
#define I2S_DOUT_PIN   8
#define PA_ENABLE_PIN  46

#define KEY_PIN            18   // krotko: wycisz budzik / wlacz panel WWW; dlugo: nic
#define PREVIEW_BUTTON_PIN 0    // krotko: podglad najblizszego budzika

#define BATTERY_ADC_CHANNEL          ADC_CHANNEL_3   // = GPIO4 na ESP32-S3
#define BATTERY_DIVIDER_RATIO        3.0f
#define BATTERY_VOLTAGE_CALIBRATION  1.017f
#define BATTERY_CAPACITY_MAH         3400    // Samsung INR18650-35E
#define BATTERY_SAMPLE_COUNT         16
#define BATTERY_EMPTY_VOLTAGE        3.00f
#define BATTERY_FULL_VOLTAGE         4.20f
#define BATTERY_FULL_FLOOR           99
#define BATTERY_FULL_HOLD_FLOOR      98
#define BATTERY_READ_INTERVAL_MS     (10UL * 60UL * 1000UL)
#define BATTERY_BUSY_RETRY_MS        (30UL * 1000UL)

// --- Ochrona niskiego stanu ogniwa (dwustopniowa) -----------------------------
constexpr uint8_t  BATTERY_LOW_PERCENT          = 15;
constexpr float    BATTERY_CRITICAL_VOLTAGE     = 3.05f;
constexpr uint8_t  BATTERY_CRITICAL_PERCENT     = 3;
constexpr uint32_t BATTERY_CRITICAL_RECHECK_SEC = 30UL * 60UL;

// --- Parametry logiki zegara / budzikow ---------------------------------------
constexpr int      ALARM_COUNT                = 3;
constexpr int      SOUND_COUNT                = 3;
constexpr int      MAX_AUDIO_VOLUME           = 21;
constexpr uint8_t  DEFAULT_AUDIO_VOLUME       = 10;
constexpr uint8_t  CODEC_VOLUME_PERCENT       = 100;
constexpr uint32_t ALARM_LATE_WINDOW_SEC      = 20;
constexpr uint32_t RING_RETRY_MS              = 3000;
constexpr uint32_t RING_MIN_PLAY_MS           = 750;
constexpr uint8_t  RING_MAX_ERRORS            = 10;
constexpr uint32_t RING_TIMEOUT_MS            = 15UL * 60UL * 1000UL;

constexpr uint32_t WEB_WINDOW_MS              = 5UL * 60UL * 1000UL;
constexpr uint32_t WEB_WIFI_GRACE_MS          = 10000;
constexpr uint32_t WIFI_HINT_FALLBACK_MS      = 5000;
constexpr uint32_t NTP_WIFI_TIMEOUT_MS        = 15000;
constexpr uint32_t NTP_PACKET_TIMEOUT_MS      = 50000;  // lwIP SNTP 3 serwery co ~15 s -> 50 s pokrywa
constexpr uint32_t NTP_WIFI_LOST_GRACE_MS     = 8000;   // zerwane WiFi w trakcie proby: tyle na powrot
constexpr uint32_t NTP_ALARM_CATCHUP_SEC      = 90;

constexpr uint32_t NTP_QUICK_RETRY_MS         = 30000;        // 30 s — seria szybka po starcie
constexpr uint32_t NTP_BACKOFF_MIN_MS         = 60000;        // 1 min
constexpr uint32_t NTP_BACKOFF_MAX_MS         = 3600000;      // 1 h

constexpr int      NTP_HOUR                   = 18;  // codzienna synchronizacja 18:00-18:05 (+ dogonienie do 23:00)
constexpr int      NTP_MIN_WINDOW             = 5;
constexpr uint32_t RTC_WRITE_RETRY_MS         = 5000;
constexpr uint8_t  RTC_WRITE_RETRIES          = 12;
constexpr int      RTC_WAKE_MAX_SKEW_SEC      = 30;

// CPU: w dzien 80 MHz wystarcza (render RLCD jest ograniczony SPI 2 MHz, a SPI/
// I2C/WiFi taktowane sa z APB, ktore przy >=80 MHz CPU i tak chodzi 80 MHz).
// 160 MHz tylko na czas dekodowania MP3 (AudioManager podbija/odpuszcza).
constexpr uint32_t DAY_CPU_MHZ                = 80;
constexpr uint32_t AUDIO_CPU_MHZ              = 160;
constexpr uint32_t NIGHT_CPU_MHZ              = 40;
#define POWER_DOWN_FLASH_IN_SLEEP 0   // NIEKOMPATYBILNE na tej plytce -> zostaje 0 NA STALE.
#define FAST_NTP_RECONNECT 1          // 1=uzyj zapamietanego kanalu+BSSID (krocej radia)
#define ST7305_STATIC_LPM 0           // 0=WYLACZONE. Tryb LPM panelu — nieprzetestowany; nie wysylamy.

constexpr uint64_t IDLE_LIGHT_SLEEP_US        = 900000ULL;    // fallback gdy czas nieznany
constexpr uint64_t IDLE_LIGHT_SLEEP_MAX_SEC   = 60ULL;        // sen do granicy minuty -> 1 wybudzenie/min
constexpr int      NIGHT_START_HOUR           = 23;
constexpr int      NIGHT_START_MIN            = 59;
constexpr int      NIGHT_END_HOUR             = 6;
constexpr int      NIGHT_END_MIN              = 0;
constexpr uint32_t NIGHT_MIN_SLEEP_SEC        = 5;
constexpr uint32_t NIGHT_FALLBACK_CHUNK_SEC   = 3600;         // maks. odcinek snu gdy alarm RTC nie uzbroil sie
constexpr uint32_t NIGHT_FALLBACK_ALARM_CHUNK_SEC = 300;      // jw. gdy najblizszy jest budzik: krocej

constexpr uint32_t BUTTON_DEBOUNCE_MS         = 40;
constexpr uint32_t WEB_LONG_PRESS_MS          = 1500;         // KEY przytrzymany >= tyle -> panel WWW
constexpr uint32_t ALARM_PREVIEW_MS           = 5000;
constexpr uint32_t WAKE_HOLD_MS               = 15000;        // po wybudzeniu przyciskiem w nocy: pokaz tresc 15 s

// --- Stale konfiguracyjne (TZ, NTP, WiFi, dzwieki) ----------------------------
static const char *TZ_POLAND    = "CET-1CEST,M3.5.0/2,M10.5.0/3";
static const char *NTP_SERVER_1 = "pool.ntp.org";
static const char *NTP_SERVER_2 = "time.google.com";
static const char *NTP_SERVER_3 = "time.cloudflare.com";

static const char *DEFAULT_WIFI_SSID = "";
static const char *DEFAULT_WIFI_PASS = "";

