Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v7.0.ino
static const char *SOUND_FILES[SOUND_COUNT] = { "/alarm1.mp3", "/alarm2.mp3", "/alarm3.mp3" };
static const char *SOUND_NAMES[SOUND_COUNT] = { "Dzwiek 1", "Dzwiek 2", "Dzwiek 3" };

static const char *NVS_NS = "zegar7";   // przestrzen nazw Preferences

// ============================================================================
//  Model danych
// ============================================================================
struct AlarmConfig {
  uint8_t enabled;
  uint8_t hour;
  uint8_t minute;
  uint8_t second;
  uint8_t volume;     // 0..MAX_AUDIO_VOLUME
  uint8_t sound;      // indeks 0..SOUND_COUNT-1 -> SOUND_FILES
  char    label[16];
};

// Stan przezywajacy deep-sleep (noc/krytyka). POD w RTC_DATA_ATTR: konstruktor nie
// rusza go przy wybudzeniu (wartosci trwaja), a cold boot zeruje go jawnie w
// App::setup() (czesc pol wymaga sentineli -1, nie zwyklego zera).
struct PersistentState {
  uint8_t    batteryPercent;
  float      batteryVoltage;
  bool       batteryHasReading;
  DrainState drain;
  int        lastSummaryDay;
  uint8_t    wifiBssid[6];
  int32_t    wifiChannel;
  bool       wifiHint;
  uint16_t   bootCount;
  int64_t    coldBootEpoch;
  int32_t    lastRtcDriftSec;
  int64_t    lastNtpSyncEpoch;
  int64_t    prevNtpSyncEpoch;
  int        lastTriggerDay[ALARM_COUNT];   // dedup wyzwolen budzikow
  int        ntpStartedDay;                 // dobowa synchronizacja 18:00
  int        ntpMorningDay;                 // poranne NTP po wybudzeniu 06:00
#if ENABLE_RTC_AUTOTRIM
  bool       rtcPhaseAligned;               // ostatni writeRtc wyrownal faze -> okno mierzalne
  float      lastDriftPpm;                  // ostatni pomiar fazowy (diagnostyka /info)
  int32_t    lastDriftWindowSec;            // dlugosc okna tego pomiaru
  uint16_t   autotrimAdjustCount;           // ile razy offset skorygowano automatycznie
#endif
};
static RTC_DATA_ATTR PersistentState g_persist;

// ============================================================================
//  Singletony sterownikow sprzetu (konstruowane przy starcie statycznym; same
//  nie dotykaja sprzetu az do begin()). Managery owijaja na nich logike.
// ============================================================================
// RST = U8X8_PIN_NONE: U8g2 nigdy sam nie pulsuje resetu — robimy to recznie w
// DisplayManager::setup() przy KAZDYM wejsciu w setup (zimny start ORAZ deep-sleep).
static U8G2_ST7305_300X400_F_4W_HW_SPI display(
  U8G2_R1, RLCD_CS_PIN, RLCD_DC_PIN, U8X8_PIN_NONE);
static WebServer   server(80);
static Preferences prefs;
static Audio       audio;

static const gpio_num_t HOLD_PINS[] = {
  (gpio_num_t)RLCD_DC_PIN, (gpio_num_t)RLCD_CS_PIN, (gpio_num_t)RLCD_SCK_PIN,
  (gpio_num_t)RLCD_MOSI_PIN, (gpio_num_t)RLCD_RST_PIN
};

// Gate atomic odrozniajacy realna odpowiedz serwera NTP od czasu wstepnie
// ustawionego z RTC. Callback SNTP musi byc wolna funkcja C.
static std::atomic<bool> g_ntpGotPacket{false};
static std::atomic<bool> g_ntpAcceptPacket{false};
static void onSntpSync(struct timeval *tv) {
  if (tv && g_ntpAcceptPacket.load(std::memory_order_acquire))
    g_ntpGotPacket.store(true, std::memory_order_release);
}

static void audioInfo(Audio::msg_t m) {
  Serial.printf("Audio %s: %s\n", m.s ? m.s : "", m.msg ? m.msg : "");
}

// ============================================================================
//  [3a] CZAS — konwersje cywilne (czyste funkcje, bez stanu)
// ============================================================================
static int daysFromCivil(int y, unsigned m, unsigned d) {
  y -= m <= 2;
  const int era = (y >= 0 ? y : y - 399) / 400;
  const unsigned yoe = (unsigned)(y - era * 400);
  const unsigned doy = (153 * (m + (m > 2 ? -3 : 9)) + 2) / 5 + d - 1;
  const unsigned doe = yoe * 365 + yoe / 4 - yoe / 100 + doy;
  return era * 146097 + (int)doe - 719468;
}

static time_t utcEpochFromCivil(int y, int mo, int d, int h, int mi, int s) {
  return (time_t)daysFromCivil(y, (unsigned)mo, (unsigned)d) * 86400 + h * 3600 + mi * 60 + s;
}

static int localDayKey(const struct tm &t) {
  return (t.tm_year + 1900) * 400 + t.tm_yday;
}

static bool isNightMode(const struct tm &t) {
  int now = t.tm_hour * 60 + t.tm_min;
  int start = NIGHT_START_HOUR * 60 + NIGHT_START_MIN;
  int end   = NIGHT_END_HOUR * 60 + NIGHT_END_MIN;
  if (start < end) return now >= start && now < end;
  if (start > end) return now >= start || now < end;
  return false;
}

static bool isSupportedEpoch(time_t epoch) {
  if (epoch < 1700000000) return false;
  struct tm gm;
  gmtime_r(&epoch, &gm);
  int year = gm.tm_year + 1900;
  return year >= 2024 && year <= 2099;
}

static bool getLocalTm(struct tm *out) {
  time_t now = time(nullptr);
  if (!isSupportedEpoch(now)) return false;
  localtime_r(&now, out);
  return true;
}

static void setSystemEpoch(time_t epoch) {
  struct timeval tv = { .tv_sec = epoch, .tv_usec = 0 };
  settimeofday(&tv, nullptr);
}

// Kotwiczenie czasu odczytanego z RTC: odczyt ma rozdzielczosc 1 s i nieznana
// faze (0..1 s po przewrocie), wiec wpis w POLOWIE sekundy minimalizuje
// oczekiwany |blad| fazy zegara systemowego (0.25 s zamiast 0.5 s).
static void setSystemEpochMidSecond(time_t epoch) {
  struct timeval tv = { .tv_sec = epoch, .tv_usec = 500000 };
  settimeofday(&tv, nullptr);
}

static time_t epochForClock(struct tm base, int h, int mi, int s, int addDays) {
  base.tm_hour = h; base.tm_min = mi; base.tm_sec = s;
  base.tm_mday += addDays;     // mktime normalizuje przepelnienie
  base.tm_isdst = -1;          // mktime sam ustali DST
  return mktime(&base);        // poprawne przez noc zmiany czasu (doba != 86400 s)
}

static bool alarmDueNow(const struct tm &nowTm, time_t now, uint8_t h, uint8_t mi,
                        uint8_t s, uint32_t lateWindowSec, int *occurrenceDay) {
  time_t alarmAt = epochForClock(nowTm, h, mi, s, 0);
  if (alarmAt > now) alarmAt = epochForClock(nowTm, h, mi, s, -1);
  time_t delaySec = now - alarmAt;
  if (delaySec < 0 || (uint64_t)delaySec > lateWindowSec) return false;
  if (occurrenceDay) {
    struct tm alarmTm;
    localtime_r(&alarmAt, &alarmTm);
    *occurrenceDay = localDayKey(alarmTm);
  }
  return true;
}

