Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v7.0.ino
  // Pelne uspienie: wycisz DAC i wprowadz uklad w reset (bloki analogowe off).
  bool powerDown() {
    write(0x32, 0x00);
    return write(0x00, 0x1F);
  }

private:
  TwoWire *wire_;
  bool write(uint8_t reg, uint8_t value) {
    wire_->beginTransmission(ES8311_ADDR);
    wire_->write(reg);
    wire_->write(value);
    return wire_->endTransmission() == 0;
  }
  uint8_t read(uint8_t reg) {
    wire_->beginTransmission(ES8311_ADDR);
    wire_->write(reg);
    wire_->endTransmission(false);
    wire_->requestFrom((uint16_t)ES8311_ADDR, (uint8_t)1, true);
    return wire_->available() ? wire_->read() : 0;
  }
  bool configSampleRate48k() {
    bool ok = true;
    ok &= write(0x02, 0x00);
    ok &= write(0x03, 0x10);
    ok &= write(0x04, 0x10);
    ok &= write(0x05, 0x00);
    ok &= write(0x06, (read(0x06) & 0xE0) | 0x03);
    ok &= write(0x07, 0x00);
    ok &= write(0x08, 0xFF);
    return ok;
  }
};

static ES8311Codec codec;   // singleton kodeka (po definicji klasy)

// ============================================================================
//  Koordynator (forward) — kazdy manager trzyma App& jako mediator do rodzenstwa.
// ============================================================================
class App;

// ============================================================================
//  [3b] RtcManager — PCF85063A: czas (z wyrownaniem fazy), offset, alarm wybudz.
// ============================================================================
class RtcManager {
public:
  explicit RtcManager(App &app) : app_(app) {}

  bool readToSystem();
  bool readEpoch(time_t *epoch);                    // requireCurrentFormat = true
  bool writeRtc(time_t epoch, bool audioActive);    // audioActive: pomija wyrownanie fazy
  bool ensureOffsetCalibration();
  bool setWakeAlarm(time_t epoch);
  bool disableWakeAlarm();
#if ENABLE_RTC_AUTOTRIM
  void setTargetOffsetLsb(int8_t lsb) { targetOffsetReg_ = encodeRtcOffset(lsb, false); }
  bool applyOffsetLsb(int8_t lsb);                  // zapis+weryfikacja rejestru 0x02
  bool measureDriftUs(int64_t *driftUs);            // faza RTC vs czas systemowy (~ms)
#endif

  // Diagnostyka offsetu (do /info).
  uint8_t offsetRaw() const      { return offsetRaw_; }
  uint8_t targetOffsetRaw() const { return targetOffsetReg_; }
  int8_t  offsetLsb() const      { return offsetLsb_; }
  float   offsetPpm() const      { return offsetPpm_; }
  bool    offsetVerified() const { return offsetVerified_; }

private:
  App    &app_;
  uint8_t targetOffsetReg_ = RTC_OFFSET_VALUE;   // docelowa zawartosc 0x02 (NVS moze nadpisac)
  uint8_t offsetRaw_      = 0xFF;
  int8_t  offsetLsb_      = 0;
  float   offsetPpm_      = 0.0f;
  bool    offsetVerified_ = false;

  bool beginSession();
  bool writeReg(uint8_t reg, uint8_t value);
  bool readRegs(uint8_t reg, uint8_t *buf, uint8_t n);
  bool readControl1(uint8_t *control1);
  bool readControl2(uint8_t *control2);
  bool writeControl1(uint8_t control1);
  bool releaseClock(uint8_t runningControl1);
  bool prepareTimeWrite(uint8_t *runningControl1);
  bool hasCurrentFormat();
  bool storeCurrentFormat();
  bool invalidateCurrentFormat();
  bool readEpochInternal(time_t *epoch, bool requireCurrentFormat);
  bool configureWakeInterrupt(bool alarmEnabled);
  bool verifyWakeInterruptConfig(bool alarmEnabled);
  bool verifyWakeAlarm(time_t epoch);
};

// ============================================================================
//  FileStore — system plikow MP3 (SPIFFS/LittleFS/FFat), montowany leniwie.
// ============================================================================
class FileStore {
public:
  bool ensureMounted();
  fs::FS     *fs() const   { return fs_; }
  const char *name() const { return fsName_; }
  bool        mounted() const { return mounted_ && fs_; }

private:
  bool        mounted_     = false;
  fs::FS     *fs_          = nullptr;
  const char *fsName_      = "brak";
  bool        formatTried_ = false;
  bool recoverSoundFilesOnce();
  void recoverSoundFiles();
};

// ============================================================================
//  [7] BatteryManager — ADC, krzywa OCV->SoC, estymator, ochrona ogniwa
// ============================================================================
class BatteryManager {
public:
  explicit BatteryManager(App &app) : app_(app) {}

  bool init();
  void update(bool force);
  uint8_t percent() const    { return g_persist.batteryPercent; }
  float   voltage() const    { return g_persist.batteryVoltage; }
  bool    hasReading() const { return g_persist.batteryHasReading; }
#if ENABLE_LOW_BATTERY_PROTECT
  bool isLow() const;
  bool isCritical() const;
#endif

private:
  App &app_;
  adc_oneshot_unit_handle_t adc_  = nullptr;
  adc_cali_handle_t         cali_ = nullptr;
  bool     ready_     = false;
  bool     caliReady_ = false;
  uint32_t nextReadMs_ = 0;

  static uint8_t percentFromVoltage(float v);
  uint8_t stabilizePercent(uint8_t measured);
  void    maybeWriteDailySummary(time_t now);
};

// ============================================================================
//  [6a] AudioManager — odtwarzanie MP3 (ES8311 + I2S) oraz petla "dzwonienia"
// ============================================================================
class AudioManager {
public:
  explicit AudioManager(App &app) : app_(app) {}

  bool ensureCodec();
  void shutdownCodec();
  void codecPowerDown();        // ES8311 w stan niskiego poboru (setup)
  bool startSound(uint8_t soundIndex, uint8_t volume);
  void stopPlayback(bool userStopped);
  void startRinging(int alarmIndex);
  void serviceAudio();
  void serviceRinging();

  bool isPlaying() const    { return playing_; }
  bool isRinging() const    { return ringing_; }
  bool codecActive() const  { return ready_; }    // kodek nie uspiony (idlePowerSave)

private:
  App &app_;
  void ensurePins();
  bool     pinsReady_ = false;
  bool     ready_     = false;     // audioReady (kodek skonfigurowany)
  bool     playing_   = false;
  uint32_t soundStartedMs_ = 0;
  // stan dzwonienia budzika
  bool     ringing_         = false;
  int      ringingAlarm_    = -1;
  uint32_t ringStartMs_     = 0;
  uint32_t ringLastRetryMs_ = 0;
  uint8_t  ringErrors_      = 0;
};

// ============================================================================
//  [10a] AlarmManager — model budzikow, harmonogram wyzwolen, dedup kolizji DST
// ============================================================================
class AlarmManager {
public:
  explicit AlarmManager(App &app) : app_(app) {}

  void setDefaults();
  void resetTriggerState();
  void sanitize(int index);
  void sanitizeAll();
  AlarmConfig       &config(int i)       { return alarms_[i]; }
  const AlarmConfig &config(int i) const { return alarms_[i]; }
  AlarmConfig       *raw()               { return alarms_; }     // NVS getBytes/putBytes
  size_t             rawSize() const     { return sizeof(alarms_); }

