Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v7.0.ino
  bool anyEnabled() const;
  int  nextAlarmIndex(uint8_t *h, uint8_t *mi, uint8_t *s, char *label, size_t labelSize);
  void checkAlarms(uint32_t lateWindowSec = ALARM_LATE_WINDOW_SEC);

  // Uzywane przez PowerManager przy planowaniu snu.
  bool   anyDueNow(const struct tm &t);
  time_t nextEpoch(const struct tm &base, time_t now);

private:
  App        &app_;
  AlarmConfig alarms_[ALARM_COUNT];
};

// ============================================================================
//  [5] NtpService — WiFi + NTP, nieblokujaca maszyna stanow + harmonogram dobowy
// ============================================================================
enum class NtpSyncState : uint8_t { IDLE, WIFI_CONNECTING, WAITING_PACKET };

class NtpService {
public:
  explicit NtpService(App &app) : app_(app) {}

  void syncNtp(bool manual);
  bool service();                       // true gdy NTP wlasnie zatwierdzil nowy czas
  void checkSchedule();                 // dobowa synchronizacja 18:00 (+ dogonienie)
  void handleRtcWriteRetry();
  void stopWifiAndNtp();
  bool ensureWifi(uint32_t timeoutMs);  // blokujace laczenie (tylko panel WWW)

  void setRetries(uint8_t n)   { retriesLeft_ = n; }
  bool isBusy() const          { return state_ != NtpSyncState::IDLE; }
  bool rtcWritePending() const { return rtcWriteRetriesLeft_ != 0; }
  long secsSinceLastSync() const;

  const char *ssid() const { return ssid_; }
  const char *pass() const { return pass_; }   // tylko do zapisu NVS (NIE renderowane w HTML)
  void setCreds(const char *s, const char *p);
  void setSsid(const String &s);
  void setPass(const String &p);

private:
  App         &app_;
  NtpSyncState state_         = NtpSyncState::IDLE;
  bool         manualAttempt_ = false;
  bool         wifiHintActive_ = false;
  uint32_t     stateStartedMs_ = 0;
  struct timeval fallbackTime_ = {};    // snapshot czasu przed proba (rollback po bledzie)
  uint8_t      retriesLeft_ = 0;
  uint32_t     nextRetryMs_ = 0;
  uint32_t     backoffMs_   = NTP_BACKOFF_MIN_MS;
  uint32_t     wifiLostMs_  = 0;        // od kiedy WiFi zerwane w trakcie WAITING_PACKET
  uint8_t      rtcWriteRetriesLeft_ = 0;
  uint32_t     rtcWriteNextRetryMs_ = 0;
  char         ssid_[33] = "";
  char         pass_[65] = "";

  bool wifiBeginSmart();
  void wifiRetryFullScan();
  void wifiCacheHint();
  void stopSntpCallbacks();
  void restoreTimeAfterFailedNtp();
  void beginNtpRequest();
  void finishNtpAttempt(bool ok);
  bool handleNtpRetry();
  void scheduleRtcWriteRetry(uint8_t retries = RTC_WRITE_RETRIES);
#if ENABLE_RTC_AUTOTRIM
  void maybeAutotrimRtc(time_t syncedEpoch);
#endif
};

// ============================================================================
//  [8] DisplayManager (U8g2) — strony, ikony, dedup repaintu (clockSig)
// ============================================================================
class DisplayManager {
public:
  explicit DisplayManager(App &app) : app_(app) {}

  void setup(bool coldBoot);
  void update();                    // dispatcher updateDisplay
  void drawNightPage();             // wolane przez PowerManager przed deep-sleep
#if ENABLE_LOW_BATTERY_PROTECT
  void drawCriticalBatteryPage();   // jw. przed ochronnym snem
#endif

private:
  App     &app_;
  int      lastDrawMinute_ = -1;
  int      lastDrawDay_    = -1;
  uint32_t lastClockSig_   = 0xFFFFFFFFu;   // sentinel = wymus repaint

  void     st7305SetStaticLowPower(bool enable);
  void     drawPhotoGlyph(int x, int y, int glyph, bool colon);
  void     drawLargeTime(uint8_t hour, uint8_t minute, int y);
  void     drawBellIcon(int x, int y, bool active);
  void     drawBatteryIcon(int x, int y, uint8_t percent);
  void     drawCentered(const char *text, int y);
  uint32_t clockSig(const struct tm &t, int day);
  void     drawClockPage(const struct tm &t);
  void     drawPreviewPage();
  void     drawRingingPage();
};

// ============================================================================
//  [9] WebManager — panel konfiguracji, sync, pliki MP3, /info (WiFi na zadanie)
// ============================================================================
class WebManager {
public:
  explicit WebManager(App &app) : app_(app) {}

  bool startWebWindow();
  void service();              // obsluga w loop(): grace WiFi + handleClient + timeout
  bool isActive() const { return active_; }
  void forceStop();           // server.stop + active_=false (przy zasypianiu nocnym)

private:
  App     &app_;
  bool     active_         = false;
  bool     routesInstalled_ = false;
  uint32_t untilMs_        = 0;
  uint32_t wifiLostMs_     = 0;

  File     mp3UploadFile_;
  bool     mp3UploadAccepted_ = false;
  bool     mp3UploadHadData_  = false;
  String   mp3UploadPath_     = "";
  String   mp3UploadTempPath_ = "";

  void stopWindow();          // stopWebWindow
  void installRoutes();
  void redirectHome();        // 303 -> "/" (wspolne zakonczenie akcji POST/GET)
  void appendMp3Manager(String &html);
  void pageHeader(String &h);
  void handleRoot();
  void handleSave();
  void handleSync();
  void handleStop();
  void handleTest();
  void handleMp3UploadDone();
  void handleMp3UploadStream();
  void handleMp3Delete();
  void handleWebOff();
#if ENABLE_DIAGNOSTICS
  void handleInfo();
#endif
};

// ============================================================================
//  [11] PowerManager — tryb nocny (deep-sleep), light-sleep, ochronny sen
// ============================================================================
class PowerManager {
public:
  explicit PowerManager(App &app) : app_(app) {}

  void releaseNightHolds();
  void enterNightSleepIfNeeded(bool force);
  void idlePowerSave();
#if ENABLE_LOW_BATTERY_PROTECT
  void enterCriticalBatterySleepIfNeeded();
#endif

private:
  App     &app_;
  void     holdNightPins();
  void     shutdownNightPeripherals();
  time_t   nightEndEpoch(time_t now);
  uint64_t computeIdleSleepUs();
};

// ============================================================================
//  Przyciski (KEY = wycisz/panel WWW, PREVIEW = podglad budzika)
// ============================================================================
class Buttons {
public:
  explicit Buttons(App &app) : app_(app) {}

  void begin();                  // pinMode KEY/PREVIEW + stan poczatkowy
  void handleKey();
  void handleBoot();
  void showPreview();
  void primeKeyPress();          // setup: zacznij mierzyc nacisniecie KEY (bez wakeHold)
  void primeKeyPressFromWake();  // wybudzenie z light-sleep: jw. + utrzymaj wybudzenie
  void onPreviewWakeFromSleep(); // wybudzenie z light-sleep przyciskiem PREVIEW

  void holdWake()           { wakeHoldUntilMs_ = millis() + WAKE_HOLD_MS; }
  bool wakeHeld() const     { return (int32_t)(millis() - wakeHoldUntilMs_) < 0; }
  bool previewActive() const       { return previewActive_; }
  bool previewWithinWindow() const { return (int32_t)(millis() - previewUntilMs_) < 0; }
  void clearPreview()              { previewActive_ = false; }

