Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v7.0.ino
private:
  App     &app_;
  bool     keyRaw_ = HIGH, keyStable_ = HIGH;
  uint32_t keyChangedMs_ = 0, keyPressMs_ = 0;
  bool     keyLongFired_ = false;
  bool     bootRaw_ = HIGH, bootStable_ = HIGH;
  uint32_t bootChangedMs_ = 0, bootPressedMs_ = 0;
  bool     previewActive_  = false;
  uint32_t previewUntilMs_ = 0;
  uint32_t wakeHoldUntilMs_ = 0;
};

// ============================================================================
//  [4] Settings — NVS (alarmy + WiFi) oraz diagnostyka resetu
// ============================================================================
class Settings {
public:
  explicit Settings(App &app) : app_(app) {}

  void load();
  void save();
#if ENABLE_RTC_AUTOTRIM
  void saveRtcOffset(int8_t lsb);   // tylko klucz "rtcOffLsb" (bez przepisywania reszty)
#endif
#if ENABLE_DIAGNOSTICS
  void     recordResetReason(esp_reset_reason_t r);
  uint32_t brownoutResets() const { return brownoutResets_; }
  uint32_t wdtResets() const      { return wdtResets_; }
  uint32_t panicResets() const    { return panicResets_; }
#endif

private:
  App &app_;
#if ENABLE_DIAGNOSTICS
  uint32_t brownoutResets_ = 0;
  uint32_t wdtResets_      = 0;
  uint32_t panicResets_    = 0;
#endif
};

// ============================================================================
//  App — koordynator. Trzyma wszystkie managery i stan UI; udostepnia rodzenstwo
//  jako mediator (kazdy manager dostaje tylko App&). Agreguje wspoldzielona
//  bramke "zajetosci" (dawniej powielana 3x w sleepach).
// ============================================================================
class App {
public:
  App()
    : rtc_(*this), battery_(*this), audio_(*this), alarm_(*this),
      ntp_(*this), display_(*this), web_(*this), power_(*this),
      buttons_(*this), settings_(*this) {}

  void setup();
  void loop();

  // --- mediator: dostep do rodzenstwa ---
  FileStore       &fs()       { return fs_; }
  RtcManager      &rtc()      { return rtc_; }
  BatteryManager  &battery()  { return battery_; }
  AudioManager    &audio()    { return audio_; }
  AlarmManager    &alarm()    { return alarm_; }
  NtpService      &ntp()      { return ntp_; }
  DisplayManager  &display()  { return display_; }
  WebManager      &web()      { return web_; }
  PowerManager    &power()    { return power_; }
  Buttons         &buttons()  { return buttons_; }
  Settings        &settings() { return settings_; }
  PersistentState &persist()  { return g_persist; }

  // --- stan UI (dawne globale displayDirty / statusText / ntpStatus) ---
  void markDirty()                   { dirty_ = true; }
  void clearDirty()                  { dirty_ = false; }
  bool dirty() const                 { return dirty_; }
  void setStatus(const String &s)    { statusText_ = s; }
  const String &statusText() const   { return statusText_; }
  void setNtpStatus(const String &s) { ntpStatus_ = s; }
  const String &ntpStatus() const    { return ntpStatus_; }

  // --- bramki wspoldzielone ---
  bool audioActive() const { return audio_.isPlaying() || audio_.isRinging(); }
  // Stan, w ktorym NIE wolno uspic na dlugo (suma warunkow z 3 dawnych miejsc).
  bool busy() const {
    return audioActive() || web_.isActive() || buttons_.previewActive() ||
           ntp_.isBusy() || ntp_.rtcWritePending();
  }

  uint32_t &lastAlarmCheckMs() { return lastAlarmCheckMs_; }

private:
  FileStore      fs_;
  RtcManager     rtc_;
  BatteryManager battery_;
  AudioManager   audio_;
  AlarmManager   alarm_;
  NtpService     ntp_;
  DisplayManager display_;
  WebManager     web_;
  PowerManager   power_;
  Buttons        buttons_;
  Settings       settings_;

  bool     dirty_      = true;
  String   statusText_ = "IDLE";
  String   ntpStatus_  = "never";
  uint32_t lastAlarmCheckMs_ = 0;   // loop(): poszerza okno spoznienia o przestoj petli
};

App app;   // jedyna instancja koordynatora

// ============================================================================
//  DEFINICJE METOD — RtcManager (PCF85063A). Logika 1:1 z wersji proceduralnej.
// ============================================================================
// Odblokowanie zawieszonej szyny I2C: slave (RTC/kodek) trzymajacy SDA nisko po
// resecie ESP w polowie transakcji zwalnia ja po maks. 9 impulsach SCL + STOP.
// Bez tego kazda sesja RTC pada az do odlaczenia zasilania. Zwraca true, gdy
// szyna byla zawieszona i zostala uwolniona.
static bool i2cBusRecover() {
  // Sonda BEZ pinMode: rekonfiguracja pinu I2C w core 3.x przechodzi przez
  // Peripheral Manager i deinicjalizuje caly sterownik Wire (wspoldzielony z
  // ES8311) — nawet przy zwyklym NACK. gpio_get_level czyta stan szyny nie
  // dotykajac konfiguracji (bufor wejsciowy SDA wlaczony przez sterownik I2C).
  if (gpio_get_level((gpio_num_t)I2C_SDA_PIN) == 1) return false;   // SDA wolne -> zwykly NACK
  Wire.end();                                           // jawny demontaz PRZED przejeciem pinow
  pinMode(I2C_SDA_PIN, INPUT_PULLUP);
  pinMode(I2C_SCL_PIN, OUTPUT_OPEN_DRAIN);
  digitalWrite(I2C_SCL_PIN, HIGH);
  for (uint8_t i = 0; i < 9 && digitalRead(I2C_SDA_PIN) == LOW; i++) {
    digitalWrite(I2C_SCL_PIN, LOW);  delayMicroseconds(50);
    digitalWrite(I2C_SCL_PIN, HIGH); delayMicroseconds(50);
  }
  pinMode(I2C_SDA_PIN, OUTPUT_OPEN_DRAIN);              // warunek STOP: SDA lo->hi przy SCL hi
  digitalWrite(I2C_SDA_PIN, LOW);  delayMicroseconds(50);
  digitalWrite(I2C_SDA_PIN, HIGH); delayMicroseconds(50);
  bool freed = digitalRead(I2C_SDA_PIN) == HIGH;
  Serial.printf("I2C: szyna zawieszona -> odzysk %s\n", freed ? "OK" : "NIEUDANY");
  return freed;
}

bool RtcManager::beginSession() {
  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);
  Wire.setClock(400000);
  Wire.beginTransmission(PCF85063A_ADDR);
  if (Wire.endTransmission() == 0) return true;
  if (!i2cBusRecover()) return false;                   // NACK bez zwisu SDA -> zwykly blad
  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);                 // po odzysku pelna re-inicjalizacja
  Wire.setClock(400000);
  Wire.beginTransmission(PCF85063A_ADDR);
  return Wire.endTransmission() == 0;
}

