Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v7.0.ino
bool RtcManager::writeReg(uint8_t reg, uint8_t value) {
  Wire.beginTransmission(PCF85063A_ADDR);
  Wire.write(reg);
  Wire.write(value);
  return Wire.endTransmission() == 0;
}

// Odczyt n rejestrow od 'reg' jednym transferem. Wolajacy juz otworzyl sesje.
bool RtcManager::readRegs(uint8_t reg, uint8_t *buf, uint8_t n) {
  Wire.beginTransmission(PCF85063A_ADDR);
  Wire.write(reg);
  if (Wire.endTransmission(false) != 0) return false;
  if (Wire.requestFrom((uint8_t)PCF85063A_ADDR, n) != n) return false;
  for (uint8_t i = 0; i < n; i++) buf[i] = Wire.read();
  return true;
}

bool RtcManager::readControl1(uint8_t *control1) {
  if (!control1 || !beginSession()) return false;
  return readRegs(0x00, control1, 1);
}
bool RtcManager::readControl2(uint8_t *control2) {
  if (!control2 || !beginSession()) return false;
  return readRegs(0x01, control2, 1);
}
bool RtcManager::writeControl1(uint8_t control1) { return writeReg(0x00, control1); }

bool RtcManager::releaseClock(uint8_t runningControl1) {
  for (uint8_t attempt = 0; attempt < 3; attempt++) {
    if (writeControl1(runningControl1)) return true;
    delay(2);
  }
  return false;
}

// Zatrzymaj licznik przed ustawieniem czasu. STOP zeruje glowna czesc preskalera
// -> pierwszy impuls sekundowy ma okreslona faze.
bool RtcManager::prepareTimeWrite(uint8_t *runningControl1) {
  if (!runningControl1) return false;
  uint8_t control1;
  if (!readControl1(&control1)) return false;
  *runningControl1 = control1 & (uint8_t)~((1U << 7) | (1U << 5) | (1U << 2) | (1U << 1));
  if (writeControl1(*runningControl1 | (1U << 5))) return true;
  releaseClock(*runningControl1);
  return false;
}

bool RtcManager::hasCurrentFormat() {
  uint8_t marker;
  return readRegs(0x03, &marker, 1) && marker == RTC_FORMAT_MARKER;
}
bool RtcManager::storeCurrentFormat()      { return writeReg(0x03, RTC_FORMAT_MARKER); }
bool RtcManager::invalidateCurrentFormat() { return writeReg(0x03, 0); }

// Odczyt 7 rejestrow czasu (0x04..0x0A) jednym transferem -> brak rwania na granicy
// sekundy. Rok 00..99 = 2000..2099.
bool RtcManager::readEpochInternal(time_t *epoch, bool requireCurrentFormat) {
  if (!epoch) return false;
  uint8_t control1;
  if (!readControl1(&control1)) return false;

  // Nie wznawiaj po cichu zatrzymanego/przestawionego RTC (staly czas != aktualny).
  const uint8_t invalidModeMask = (1U << 7) | (1U << 5) | (1U << 1);
  if ((control1 & invalidModeMask) != 0 ||
      (requireCurrentFormat && !hasCurrentFormat())) return false;

  uint8_t t[7];
  if (!readRegs(0x04, t, 7)) return false;
  uint8_t secReg = t[0], minReg = t[1], hourReg = t[2], dayReg = t[3];
  uint8_t monReg = t[5], yearReg = t[6];   // t[4] = dzien tygodnia (pomijamy)

  bool oscStopped = (secReg & 0x80) != 0;
  secReg &= 0x7F; minReg &= 0x7F; hourReg &= 0x3F; dayReg &= 0x3F; monReg &= 0x1F;

  if (oscStopped || !validBcd(secReg) || !validBcd(minReg) || !validBcd(hourReg) ||
      !validBcd(dayReg) || !validBcd(monReg) || !validBcd(yearReg)) return false;

  int s  = bcd2dec(secReg), mi = bcd2dec(minReg), h = bcd2dec(hourReg);
  int d  = bcd2dec(dayReg), mo = bcd2dec(monReg), y = bcd2dec(yearReg) + 2000;

  if (!validDateTime(y, mo, d, h, mi, s)) return false;
  *epoch = utcEpochFromCivil(y, mo, d, h, mi, s);
  return true;
}

bool RtcManager::readEpoch(time_t *epoch) { return readEpochInternal(epoch, true); }

bool RtcManager::readToSystem() {
  for (uint8_t attempt = 0; attempt < 3; attempt++) {
    time_t epoch;
    if (readEpoch(&epoch)) { setSystemEpochMidSecond(epoch); return true; }
    delay(2);
  }
  return false;
}

// Zapis czasu UTC do RTC z WYROWNANIEM do granicy sekundy. Po zwolnieniu STOP
// preskaler startuje od zera, wiec wpisana sekunda "trzyma sie" ~1.0 s -> faza
// przewrotu = chwila zwolnienia STOP. Pomijamy wyrownanie gdy gra audio/budzik
// (audioActive) — busy-wait do ~1 s przerwalby audio.loop().
bool RtcManager::writeRtc(time_t epoch, bool audioActive) {
  if (!isSupportedEpoch(epoch)) return false;
#if ENABLE_RTC_AUTOTRIM
  g_persist.rtcPhaseAligned = false;   // az do potwierdzonego, wyrownanego zapisu
#endif

  struct timeval tv;
  gettimeofday(&tv, nullptr);
  time_t writeEpoch = epoch;
  bool   alignToBoundary = false;
  if (!audioActive &&
      isSupportedEpoch(tv.tv_sec) && (tv.tv_sec == epoch || tv.tv_sec + 1 == epoch)) {
    writeEpoch = tv.tv_sec + 1;          // najblizsza nadchodzaca pelna sekunda
    alignToBoundary = true;
  }

  struct tm gm;
  gmtime_r(&writeEpoch, &gm);
  int year = gm.tm_year + 1900;

  // Najpierw uniewaznij dane: reset w dowolnym dalszym miejscu nie ujawni
  // niepelnego zapisu jako poprawnego czasu.
  if (!beginSession()) return false;
  if (!invalidateCurrentFormat()) return false;
  uint8_t runningControl1;
  if (!prepareTimeWrite(&runningControl1)) return false;
  uint8_t yearReg = (uint8_t)(year % 100);

  Wire.beginTransmission(PCF85063A_ADDR);
  Wire.write(0x04);
  Wire.write(dec2bcd(gm.tm_sec) & 0x7F);            // OS=0 -> oscylator OK
  Wire.write(dec2bcd(gm.tm_min) & 0x7F);
  Wire.write(dec2bcd(gm.tm_hour) & 0x3F);
  Wire.write(dec2bcd(gm.tm_mday) & 0x3F);
  Wire.write((uint8_t)(gm.tm_wday & 0x07));
  Wire.write(dec2bcd((uint8_t)(gm.tm_mon + 1)) & 0x1F);
  Wire.write(dec2bcd(yearReg));
  if (Wire.endTransmission() != 0) { releaseClock(runningControl1); return false; }

  // Odczekaj do granicy docelowej sekundy (czas I2C wliczony), potem zwolnij STOP.
  if (alignToBoundary) {
    struct timeval nowTv;
    for (;;) {
      gettimeofday(&nowTv, nullptr);
      long remainingUs = (long)(writeEpoch - nowTv.tv_sec) * 1000000L - nowTv.tv_usec;
      if (remainingUs <= 0) break;
      if (remainingUs > 2000) delay(1); else delayMicroseconds((uint32_t)remainingUs);
    }
  }
  if (!releaseClock(runningControl1)) return false;

  time_t verifiedEpoch;
  if (!readEpochInternal(&verifiedEpoch, false)) return false;
  long long diff = (long long)verifiedEpoch - (long long)writeEpoch;
  if (diff < -2 || diff > 2) return false;
  if (storeCurrentFormat() && hasCurrentFormat()) {
#if ENABLE_RTC_AUTOTRIM
    g_persist.rtcPhaseAligned = alignToBoundary;   // okno dryftu mierzalne fazowo
#endif
    return true;
  }
  invalidateCurrentFormat();
  return false;
}

// Kalibracja sprzetowa dryfu (rejestr 0x02) Z WERYFIKACJA odczytem zwrotnym.
// Wolana przy KAZDYM starcie: rejestr jest podtrzymywany bateryjnie, ale ponowny
// zapis+odczyt dowodzi, ze bajt wszedl. Cel zapisu = targetOffsetReg_ (start:
// RTC_OFFSET_VALUE; Settings::load moze nadpisac wartoscia z NVS).
bool RtcManager::ensureOffsetCalibration() {
  offsetVerified_ = false;
  for (uint8_t attempt = 0; attempt < RTC_OFFSET_RETRIES; attempt++) {
    if (!beginSession()) { delay(2); continue; }
    writeReg(RTC_OFFSET_REG, targetOffsetReg_);
    uint8_t raw;
    if (readRegs(RTC_OFFSET_REG, &raw, 1)) {
      offsetRaw_ = raw;
      offsetLsb_ = decodeRtcOffset(raw);
      offsetPpm_ = rtcOffsetPpm(offsetLsb_, (raw & 0x80) != 0);
      if (raw == targetOffsetReg_) { offsetVerified_ = true; return true; }
    }
    delay(2);
  }
  return false;
}

