Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v7.0.ino
#if ENABLE_RTC_AUTOTRIM
bool RtcManager::applyOffsetLsb(int8_t lsb) {
  setTargetOffsetLsb(lsb);
  return ensureOffsetCalibration();
}

// Pomiar dryftu z rozdzielczoscia ~ms zamiast 1 s: czekaj (polling I2C) na
// przewrot sekundy RTC i zlap te chwile wg zegara systemowego. Wolane ZARAZ po
// pakiecie NTP (czas systemowy = wzorzec) i PRZED writeRtc (nadpisze faze).
// W przewrocie faza RTC = dokladnie 0.000 s, wiec epokaRTC*1e6 - czas_sys_us
// = dryft narosly od ostatniego wyrownanego zapisu. Blokuje do ~1.3 s — wolac
// tylko bez aktywnego audio (busy-wait zaglodzilby audio.loop()).
bool RtcManager::measureDriftUs(int64_t *driftUs) {
  if (!driftUs || !beginSession()) return false;
  uint8_t sec0, sec;
  if (!readRegs(0x04, &sec0, 1)) return false;
  sec0 &= 0x7F;
  uint32_t startMs = millis();
  do {
    if (millis() - startMs > RTC_BOUNDARY_POLL_TIMEOUT_MS) return false;   // brak przewrotu: oscylator stoi
    if (!readRegs(0x04, &sec, 1)) return false;
    sec &= 0x7F;
  } while (sec == sec0);
  struct timeval tv;
  gettimeofday(&tv, nullptr);              // chwila przewrotu wg czasu systemowego
  watchdogFeed();
  time_t rtcEpoch;
  if (!readEpochInternal(&rtcEpoch, true)) return false;
  *driftUs = (int64_t)rtcEpoch * 1000000LL -
             ((int64_t)tv.tv_sec * 1000000LL + (int64_t)tv.tv_usec);
  return true;
}
#endif

// INT sluzy wylacznie alarmowi wybudzajacemu. Wylacz korekcje, MI/HMI i countdown
// timer, skasuj flagi AF/TF, wylacz CLKOUT (mniejszy pobor RTC).
bool RtcManager::configureWakeInterrupt(bool alarmEnabled) {
  uint8_t control1;
  if (!readControl1(&control1)) return false;
  control1 &= (uint8_t)~(1U << 2);                   // CIE=0
  if (!writeReg(0x00, control1)) return false;
  if (!writeReg(0x11, 0x18)) return false;           // Timer_mode: TCF=1/60 Hz, TE=0, TIE=0
  if (!writeReg(0x10, 0)) return false;              // Timer_value
  uint8_t control2;
  if (!readControl2(&control2)) return false;
  control2 = (uint8_t)(0x07 | (alarmEnabled ? (1U << 7) : 0));   // COF=111 (CLKOUT off), AIE
  return writeReg(0x01, control2);
}

bool RtcManager::verifyWakeInterruptConfig(bool alarmEnabled) {
  uint8_t control1, control2;
  if (!readControl1(&control1) || !readControl2(&control2)) return false;
  if (!beginSession()) return false;
  uint8_t timer[2];
  if (!readRegs(0x10, timer, 2)) return false;
  uint8_t expectedControl2 = alarmEnabled ? (1U << 7) : 0;
  return (control1 & (1U << 2)) == 0 &&
         (control2 & 0xF8) == expectedControl2 &&
         timer[0] == 0 && timer[1] == 0x18;
}

bool RtcManager::verifyWakeAlarm(time_t epoch) {
  struct tm gm;
  gmtime_r(&epoch, &gm);
  if (!beginSession()) return false;
  uint8_t a[5];
  if (!readRegs(0x0B, a, 5)) return false;
  if (a[0] != (dec2bcd((uint8_t)gm.tm_sec) & 0x7F) ||
      a[1] != (dec2bcd((uint8_t)gm.tm_min) & 0x7F) ||
      a[2] != (dec2bcd((uint8_t)gm.tm_hour) & 0x3F) ||
      a[3] != (dec2bcd((uint8_t)gm.tm_mday) & 0x3F) ||
      a[4] != 0x80) return false;
  return verifyWakeInterruptConfig(true);
}

// Alarm PCF85063A pracuje w UTC (jak rejestry czasu). INT aktywne stanem niskim.
bool RtcManager::setWakeAlarm(time_t epoch) {
  time_t systemNow = time(nullptr);
  if (!isSupportedEpoch(epoch) || !isSupportedEpoch(systemNow)) return false;
  time_t rtcNow;
  if (!readEpoch(&rtcNow)) return false;     // odrzuca STOP/12h
  long long rtcSkew = (long long)rtcNow - (long long)systemNow;
  if (rtcSkew < -RTC_WAKE_MAX_SKEW_SEC || rtcSkew > RTC_WAKE_MAX_SKEW_SEC) return false;
  if (!configureWakeInterrupt(false)) return false;

  struct tm gm;
  gmtime_r(&epoch, &gm);
  if (!beginSession()) return false;
  Wire.beginTransmission(PCF85063A_ADDR);
  Wire.write(0x0B);                               // Second_alarm..
  Wire.write(dec2bcd((uint8_t)gm.tm_sec) & 0x7F); // AEN=0 -> aktywny
  Wire.write(dec2bcd((uint8_t)gm.tm_min) & 0x7F);
  Wire.write(dec2bcd((uint8_t)gm.tm_hour) & 0x3F);
  Wire.write(dec2bcd((uint8_t)gm.tm_mday) & 0x3F);
  Wire.write(0x80);                               // Weekday_alarm AEN=1 (wylaczony)
  if (Wire.endTransmission() != 0) return false;

  if (!configureWakeInterrupt(true)) return false;
  return verifyWakeAlarm(epoch);
}

bool RtcManager::disableWakeAlarm() {
  return configureWakeInterrupt(false) && verifyWakeInterruptConfig(false);
}

// ============================================================================
//  DEFINICJE METOD — FileStore (system plikow MP3)
// ============================================================================
bool FileStore::recoverSoundFilesOnce() {
  File root = fs_->open("/");
  if (!root) return false;
  for (File f = root.openNextFile(); f; f = root.openNextFile()) {
    bool isDir = f.isDirectory();
    String path = f.name();
    f.close();
    if (isDir) continue;
    if (!path.startsWith("/")) path = String("/") + path;
    String lower = path; lower.toLowerCase();
    if (lower.endsWith(".bak") && path.length() > 5) {
      String target = path.substring(0, path.length() - 4);
      bool changed = fs_->exists(target) ? fs_->remove(path) : fs_->rename(path, target);
      if (changed) { root.close(); return true; }
    } else if (lower.endsWith(".part") && path.length() > 6) {
      String target = path.substring(0, path.length() - 5);
      String backup = target + ".bak";
      if (fs_->exists(backup) && !fs_->exists(target)) continue;
      if (fs_->remove(path)) { root.close(); return true; }
    }
  }
  root.close();
  return false;
}

void FileStore::recoverSoundFiles() {
  if (!fs_) return;
  for (uint8_t pass = 0; pass < 16 && recoverSoundFilesOnce(); pass++) {}
}

bool FileStore::ensureMounted() {
  if (mounted_ && fs_) return true;
  struct { fs::FS *fs; const char *name; bool ok; } cands[] = {
    { &SPIFFS,   "SPIFFS",   SPIFFS.begin(false) },
    { &LittleFS, "LittleFS", false },
    { &FFat,     "FFat",     false },
  };
  if (!cands[0].ok) cands[1].ok = LittleFS.begin(false);
  if (!cands[0].ok && !cands[1].ok) cands[2].ok = FFat.begin(false);
  for (auto &c : cands) {
    if (c.ok) {
      mounted_ = true; fs_ = c.fs; fsName_ = c.name;
      recoverSoundFiles();
      Serial.printf("System plikow: %s\n", c.name);
      return true;
    }
  }
  // Fabrycznie czysty flash: jednorazowy format SPIFFS, by panel WWW mogl wgrac MP3.
  if (!formatTried_) {
    formatTried_ = true;
    Serial.println("Brak FS - formatuje SPIFFS...");
    if (SPIFFS.begin(true)) {
      mounted_ = true; fs_ = &SPIFFS; fsName_ = "SPIFFS";
      Serial.println("System plikow: SPIFFS (nowo sformatowany)");
      return true;
    }
  }
  mounted_ = false; fs_ = nullptr; fsName_ = "brak";
  Serial.println("Brak systemu plikow z MP3");
  return false;
}

// ============================================================================
//  DEFINICJE METOD — BatteryManager
// ============================================================================
bool BatteryManager::init() {
  if (ready_) return true;
  adc_oneshot_unit_init_cfg_t initCfg = {};
  initCfg.unit_id = ADC_UNIT_1;
  if (adc_oneshot_new_unit(&initCfg, &adc_) != ESP_OK) return false;

