Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v7.0.ino
  adc_oneshot_chan_cfg_t chanCfg = {};
  chanCfg.bitwidth = ADC_BITWIDTH_12;
  chanCfg.atten = ADC_ATTEN_DB_12;
  if (adc_oneshot_config_channel(adc_, BATTERY_ADC_CHANNEL, &chanCfg) != ESP_OK) {
    adc_oneshot_del_unit(adc_); adc_ = nullptr; return false;
  }
  adc_cali_curve_fitting_config_t caliCfg = {};
  caliCfg.unit_id = ADC_UNIT_1;
  caliCfg.atten = ADC_ATTEN_DB_12;
  caliCfg.bitwidth = ADC_BITWIDTH_12;
  caliReady_ = adc_cali_create_scheme_curve_fitting(&caliCfg, &cali_) == ESP_OK;
  ready_ = true;
  return true;
}

// Krzywa OCV->SoC dla INR18650-35E (Li-ion NMC), 3.00 V=0%, 4.20 V=100%.
uint8_t BatteryManager::percentFromVoltage(float v) {
  static const struct { float v; uint8_t soc; } OCV[] = {
    { 3.00f,   0 }, { 3.10f,   2 }, { 3.20f,   4 }, { 3.30f,   7 },
    { 3.40f,  11 }, { 3.45f,  14 }, { 3.50f,  18 }, { 3.55f,  23 },
    { 3.60f,  29 }, { 3.65f,  36 }, { 3.70f,  43 }, { 3.73f,  47 },
    { 3.76f,  51 }, { 3.79f,  55 }, { 3.82f,  59 }, { 3.85f,  63 },
    { 3.88f,  68 }, { 3.91f,  71 }, { 3.95f,  76 }, { 4.00f,  80 },
    { 4.05f,  87 }, { 4.10f,  93 }, { 4.15f,  97 }, { 4.20f, 100 },
  };
  const uint8_t N = sizeof(OCV) / sizeof(OCV[0]);
  if (v <= OCV[0].v)   return 0;
  if (v >= OCV[N-1].v) return 100;
  for (uint8_t i = 1; i < N; i++) {
    if (v < OCV[i].v) {
      float frac = (v - OCV[i-1].v) / (OCV[i].v - OCV[i-1].v);
      return (uint8_t)(OCV[i-1].soc + frac * (OCV[i].soc - OCV[i-1].soc) + 0.5f);
    }
  }
  return 100;
}

uint8_t BatteryManager::stabilizePercent(uint8_t measured) {
  if (measured >= BATTERY_FULL_FLOOR) return 100;
  if (g_persist.batteryHasReading && g_persist.batteryPercent == 100 &&
      measured >= BATTERY_FULL_HOLD_FLOOR) return 100;
  return measured;
}

// Zwiezle podsumowanie zuzycia do NVS max raz/dobe (nadpisywane, malo flash).
void BatteryManager::maybeWriteDailySummary(time_t now) {
  struct tm t; localtime_r(&now, &t);
  int day = localDayKey(t);
  if (day == g_persist.lastSummaryDay) return;
  float perDay = drainMahPerDay(g_persist.drain);
  if (perDay < 0.0f) return;
  g_persist.lastSummaryDay = day;              // oznacz dzien NIM sprobujesz zapisu
  if (!prefs.begin(NVS_NS, false)) return;
  prefs.putUShort("drnSoc", g_persist.batteryPercent);
  prefs.putFloat("drnMahDay", perDay);
  prefs.putUInt("drnDay", (uint32_t)day);
  prefs.end();
  Serial.printf("Zuzycie: %.1f mAh/dzien, ~%.0f dni\n",
                perDay, drainDaysRemaining(g_persist.drain, g_persist.batteryPercent));
}

void BatteryManager::update(bool force) {
  if (!force && (int32_t)(millis() - nextReadMs_) < 0) return;

  // Pod obciazeniem (audio, dzwoniacy budzik, serwer web) napiecie zacisku siada
  // przez rezystancje wewnetrzna ogniwa -> pomiar zanizony. Odlozyc do bezczynnosci.
  if (!force && (app_.audioActive() || app_.web().isActive())) {
    nextReadMs_ = millis() + BATTERY_BUSY_RETRY_MS; return;
  }

  nextReadMs_ = millis() + BATTERY_READ_INTERVAL_MS;
  if (!init()) { nextReadMs_ = millis() + BATTERY_BUSY_RETRY_MS; return; }

  uint32_t sum = 0; uint8_t samples = 0;
  for (uint8_t i = 0; i < BATTERY_SAMPLE_COUNT; i++) {
    int raw = 0;
    if (adc_oneshot_read(adc_, BATTERY_ADC_CHANNEL, &raw) == ESP_OK) { sum += (uint32_t)raw; samples++; }
  }
  if (samples == 0) { nextReadMs_ = millis() + BATTERY_BUSY_RETRY_MS; return; }

  int raw = (int)((sum + samples / 2) / samples);
  int mv = 0;
  if (caliReady_) adc_cali_raw_to_voltage(cali_, raw, &mv);
  else mv = (raw * 3300) / 4095;

  float measured = (mv * 0.001f) * BATTERY_DIVIDER_RATIO * BATTERY_VOLTAGE_CALIBRATION;
  if (!g_persist.batteryHasReading || force) { g_persist.batteryVoltage = measured; g_persist.batteryHasReading = true; }
  else g_persist.batteryVoltage = g_persist.batteryVoltage * 0.80f + measured * 0.20f;   // EMA

  uint8_t old = g_persist.batteryPercent;
  g_persist.batteryPercent = stabilizePercent(percentFromVoltage(g_persist.batteryVoltage));
  time_t nowT = time(nullptr);
  if (isSupportedEpoch(nowT)) {
    drainOnSample(g_persist.drain, (int64_t)nowT, g_persist.batteryPercent);
    maybeWriteDailySummary(nowT);
#if ENABLE_DIAGNOSTICS
    if (g_persist.coldBootEpoch == 0) g_persist.coldBootEpoch = (int64_t)nowT;
#endif
  }
  if (force || old != g_persist.batteryPercent) app_.markDirty();
}

#if ENABLE_LOW_BATTERY_PROTECT
bool BatteryManager::isLow() const {
  return g_persist.batteryHasReading && g_persist.batteryPercent <= BATTERY_LOW_PERCENT;
}
// update() bramkuje pomiar pod obciazeniem, wiec batteryVoltage ~ OCV.
bool BatteryManager::isCritical() const {
  return g_persist.batteryHasReading &&
         (g_persist.batteryVoltage <= BATTERY_CRITICAL_VOLTAGE ||
          g_persist.batteryPercent <= BATTERY_CRITICAL_PERCENT);
}
#endif

// ============================================================================
//  DEFINICJE METOD — AudioManager (ES8311 + MP3 przez I2S, petla dzwonienia)
// ============================================================================
void AudioManager::ensurePins() {
  if (pinsReady_) return;
  Audio::audio_info_callback = audioInfo;
  audio.setPinout(I2S_BCLK_PIN, I2S_WS_PIN, I2S_DOUT_PIN, I2S_MCLK_PIN);
  audio.setOutput48KHz(true);
  audio.setVolume(DEFAULT_AUDIO_VOLUME);
  pinsReady_ = true;
}

bool AudioManager::ensureCodec() {
  if (ready_) return true;
  setCpuFrequencyMhz(AUDIO_CPU_MHZ);  // dekoder MP3 potrzebuje zapasu ponad dzienne 80 MHz
  pinMode(PA_ENABLE_PIN, OUTPUT);
  digitalWrite(PA_ENABLE_PIN, LOW);   // PA wlacza dopiero startSound() PO konfiguracji kodeka (bez trzasku)
  ensurePins();
  ready_ = codec.begin(I2C_SDA_PIN, I2C_SCL_PIN, 400000);
  if (ready_) { codec.setVolume(CODEC_VOLUME_PERCENT); codec.configBits16(); }
  else {
    Serial.println("ES8311 init failed");
    digitalWrite(PA_ENABLE_PIN, LOW);
    setCpuFrequencyMhz(DAY_CPU_MHZ);  // audio nie ruszy -> nie trzymaj podbitego CPU
  }
  return ready_;
}

void AudioManager::codecPowerDown() { codec.powerDown(); }

// Uspij kodek po odtwarzaniu — ES8311 jest na stalej szynie 3V3, wiec to najwiekszy
// odbiornik w spoczynku. startSound() go wskrzesza. Zdejmuje tez podbicie CPU
// (nocne sciezki i tak ustawiaja NIGHT_CPU_MHZ PO tym wywolaniu).
void AudioManager::shutdownCodec() {
  if (!ready_) { digitalWrite(PA_ENABLE_PIN, LOW); return; }
  audio.stopSong();
  codec.powerDown();
  digitalWrite(PA_ENABLE_PIN, LOW);
  ready_ = false;
  setCpuFrequencyMhz(DAY_CPU_MHZ);
}

