Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v7.0.ino
bool AudioManager::startSound(uint8_t soundIndex, uint8_t volume) {
  stopPlayback(false);
  if (soundIndex >= SOUND_COUNT) soundIndex = 0;
  if (!app_.fs().ensureMounted() || !ensureCodec()) { app_.setStatus("blad FS/kodek"); app_.markDirty(); return false; }
  const char *path = SOUND_FILES[soundIndex];
  if (!app_.fs().fs()->exists(path)) { shutdownCodec(); app_.setStatus(String("brak ") + path); app_.markDirty(); return false; }

  digitalWrite(PA_ENABLE_PIN, HIGH);
  audio.stopSong();
  audio.setVolume(constrain(volume, 0, MAX_AUDIO_VOLUME));
  codec.setVolume(CODEC_VOLUME_PERCENT);
  if (!audio.connecttoFS(*app_.fs().fs(), path)) { shutdownCodec(); app_.setStatus(String("blad odtw. ") + path); app_.markDirty(); return false; }

  soundStartedMs_ = millis();
  playing_ = true;
  Serial.printf("Odtwarzam %s vol=%u\n", path, volume);
  app_.markDirty();
  return true;
}

void AudioManager::stopPlayback(bool userStopped) {
  if (userStopped) { ringing_ = false; ringingAlarm_ = -1; ringErrors_ = 0; }
  if (ready_) {
    audio.stopSong();
    audio.setVolume(0);
    codec.setVolume(0);
    digitalWrite(PA_ENABLE_PIN, LOW);
  }
  if (playing_) { app_.setStatus(userStopped ? "STOP" : "koniec"); playing_ = false; app_.markDirty(); }
}

void AudioManager::startRinging(int alarmIndex) {
  ringing_ = true;
  ringingAlarm_ = alarmIndex;
  ringStartMs_ = millis();
  ringLastRetryMs_ = millis();
  ringErrors_ = 0;
  app_.setStatus(String("BUDZI: ") + app_.alarm().config(alarmIndex).label);
  app_.markDirty();
  if (!startSound(app_.alarm().config(alarmIndex).sound, app_.alarm().config(alarmIndex).volume)) {
    ringErrors_ = 1;
    ringLastRetryMs_ = millis() - RING_RETRY_MS;
  }
}

void AudioManager::serviceAudio() {
  if (!playing_) return;
  if (!ready_) {
    playing_ = false;
    digitalWrite(PA_ENABLE_PIN, LOW);
    if (!ringing_) app_.setStatus("audio stop");
    app_.markDirty();
    return;
  }
  audio.loop();
  if (!audio.isRunning()) {
    if (ringing_) {
      // connecttoFS() zwraca true dla KAZDEGO istniejacego pliku; uszkodzony MP3
      // "konczy sie" po kilkudziesieciu ms. Bez zliczania budzik krecil sie cicho.
      playing_ = false;
      if (millis() - soundStartedMs_ < RING_MIN_PLAY_MS) {
        if (++ringErrors_ >= RING_MAX_ERRORS) { app_.setStatus("budzik: blad MP3"); ringing_ = false; ringingAlarm_ = -1; }
      } else ringErrors_ = 0;
      app_.markDirty();
      return;
    }
    stopPlayback(false);
  }
}

void AudioManager::serviceRinging() {
  if (!ringing_) return;
  if (millis() - ringStartMs_ > RING_TIMEOUT_MS) {
    app_.setStatus("budzik: timeout"); stopPlayback(false); ringing_ = false; ringingAlarm_ = -1; app_.markDirty(); return;
  }
  if (playing_) return;
  if (millis() - ringLastRetryMs_ < RING_RETRY_MS) return;
  ringLastRetryMs_ = millis();
  if (ringingAlarm_ >= 0 && startSound(app_.alarm().config(ringingAlarm_).sound, app_.alarm().config(ringingAlarm_).volume)) return;
  if (++ringErrors_ >= RING_MAX_ERRORS) { app_.setStatus("budzik: blad MP3"); ringing_ = false; ringingAlarm_ = -1; app_.markDirty(); }
}

// ============================================================================
//  DEFINICJE METOD — AlarmManager (model + harmonogram wyzwolen)
// ============================================================================
void AlarmManager::setDefaults() {
  for (int i = 0; i < ALARM_COUNT; i++) {
    alarms_[i].enabled = 0;
    alarms_[i].hour = 7; alarms_[i].minute = 0; alarms_[i].second = 0;
    alarms_[i].volume = DEFAULT_AUDIO_VOLUME;
    alarms_[i].sound = (uint8_t)i;
    snprintf(alarms_[i].label, sizeof(alarms_[i].label), "Budzik %d", i + 1);
  }
}

void AlarmManager::resetTriggerState() {
  for (int i = 0; i < ALARM_COUNT; i++) g_persist.lastTriggerDay[i] = -1;
}

void AlarmManager::sanitize(int index) {
  AlarmConfig &alarm = alarms_[index];
  alarm.enabled = alarm.enabled ? 1 : 0;
  if (alarm.hour > 23) alarm.hour = 7;
  if (alarm.minute > 59) alarm.minute = 0;
  if (alarm.second > 59) alarm.second = 0;
  if (alarm.volume > MAX_AUDIO_VOLUME) alarm.volume = DEFAULT_AUDIO_VOLUME;
  if (alarm.sound >= SOUND_COUNT) alarm.sound = (uint8_t)(index % SOUND_COUNT);
  alarm.label[sizeof(alarm.label) - 1] = '\0';
  if (alarm.label[0] == '\0')
    snprintf(alarm.label, sizeof(alarm.label), "Budzik %d", index + 1);
}

void AlarmManager::sanitizeAll() {
  for (int i = 0; i < ALARM_COUNT; i++) sanitize(i);
}

bool AlarmManager::anyEnabled() const {
  for (int i = 0; i < ALARM_COUNT; i++) if (alarms_[i].enabled) return true;
  return false;
}

// Najblizszy wlaczony budzik (dzis/jutro). Ranking po realnym epoch (mktime).
int AlarmManager::nextAlarmIndex(uint8_t *h, uint8_t *mi, uint8_t *s, char *label, size_t labelSize) {
  struct tm t;
  bool hasTime = getLocalTm(&t);
  time_t now = hasTime ? time(nullptr) : 0;
  long bestDelta = LONG_MAX;
  int best = -1;
  for (int i = 0; i < ALARM_COUNT; i++) {
    if (!alarms_[i].enabled) continue;
    long delta;
    if (hasTime) {
      time_t cand = epochForClock(t, alarms_[i].hour, alarms_[i].minute, alarms_[i].second, 0);
      if (cand <= now) cand = epochForClock(t, alarms_[i].hour, alarms_[i].minute, alarms_[i].second, 1);
      delta = (long)(cand - now);
    } else delta = i;
    if (delta < bestDelta) {
      bestDelta = delta; best = i;
      if (h) *h = alarms_[i].hour;
      if (mi) *mi = alarms_[i].minute;
      if (s) *s = alarms_[i].second;
      if (label && labelSize) { strncpy(label, alarms_[i].label, labelSize - 1); label[labelSize - 1] = 0; }
    }
  }
  return best;
}

void AlarmManager::checkAlarms(uint32_t lateWindowSec) {
  if (app_.audioActive()) return;
  time_t now = time(nullptr);
  struct tm t;
  if (!isSupportedEpoch(now)) return;
  localtime_r(&now, &t);
  for (int i = 0; i < ALARM_COUNT; i++) {
    if (!alarms_[i].enabled) continue;
    int occurrenceDay;
    if (alarmDueNow(t, now, alarms_[i].hour, alarms_[i].minute, alarms_[i].second, lateWindowSec, &occurrenceDay) &&
        g_persist.lastTriggerDay[i] != occurrenceDay) {
      g_persist.lastTriggerDay[i] = occurrenceDay;
      // Skonsumuj inne budziki wymagalne w tej samej chwili (kolizja godzin w noc
      // zmiany czasu: 02:30 i 03:30 = ten sam epoch) -> jedno dzwonienie.
      for (int j = 0; j < ALARM_COUNT; j++) {
        int otherDay;
        if (j != i && alarms_[j].enabled &&
            alarmDueNow(t, now, alarms_[j].hour, alarms_[j].minute, alarms_[j].second, lateWindowSec, &otherDay))
          g_persist.lastTriggerDay[j] = otherDay;
      }
      app_.audio().startRinging(i);
      return;
    }
  }
}

bool AlarmManager::anyDueNow(const struct tm &t) {
  time_t now = time(nullptr);
  for (int i = 0; i < ALARM_COUNT; i++)
    if (alarms_[i].enabled &&
        alarmDueNow(t, now, alarms_[i].hour, alarms_[i].minute, alarms_[i].second, ALARM_LATE_WINDOW_SEC, nullptr))
      return true;
  return false;
}

