Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v7.0.ino
time_t AlarmManager::nextEpoch(const struct tm &base, time_t now) {
  time_t best = 0;
  for (int i = 0; i < ALARM_COUNT; i++) {
    if (!alarms_[i].enabled) continue;
    time_t cand = epochForClock(base, alarms_[i].hour, alarms_[i].minute, alarms_[i].second, 0);
    if (cand <= now) cand = epochForClock(base, alarms_[i].hour, alarms_[i].minute, alarms_[i].second, 1);
    if (best == 0 || cand < best) best = cand;
  }
  return best;
}

// ============================================================================
//  DEFINICJE METOD — NtpService (WiFi + NTP). Czas z RTC pierwszy; NTP NADPISUJE
//  tylko po REALNYM pakiecie (gate atomic). WiFi tylko na czas proby.
// ============================================================================
void NtpService::setCreds(const char *s, const char *p) {
  strncpy(ssid_, s ? s : "", sizeof(ssid_) - 1);
  strncpy(pass_, p ? p : "", sizeof(pass_) - 1);
  ssid_[sizeof(ssid_) - 1] = 0;
  pass_[sizeof(pass_) - 1] = 0;
}
void NtpService::setSsid(const String &s) { s.toCharArray(ssid_, sizeof(ssid_)); }
void NtpService::setPass(const String &p) { p.toCharArray(pass_, sizeof(pass_)); }

long NtpService::secsSinceLastSync() const {
  if (g_persist.lastNtpSyncEpoch <= 0) return -1;
  time_t now = time(nullptr);
  if (!isSupportedEpoch(now)) return -1;
  long d = (long)(now - (time_t)g_persist.lastNtpSyncEpoch);
  return d < 0 ? 0 : d;
}

void NtpService::stopSntpCallbacks() {
  g_ntpAcceptPacket.store(false, std::memory_order_release);
  if (esp_sntp_enabled()) esp_sntp_stop();
  sntp_set_time_sync_notification_cb(nullptr);
}

// Rollback po nieudanym NTP: przywroc czas sprzed proby (cala sekunda).
void NtpService::restoreTimeAfterFailedNtp() {
  if (isSupportedEpoch(fallbackTime_.tv_sec)) settimeofday(&fallbackTime_, nullptr);
  else setSystemEpoch(0);
}

void NtpService::stopWifiAndNtp() {
  bool wasAttempting = state_ != NtpSyncState::IDLE;
  if (state_ == NtpSyncState::WAITING_PACKET) restoreTimeAfterFailedNtp();
  stopSntpCallbacks();
  state_ = NtpSyncState::IDLE;
  manualAttempt_ = false;
  wifiHintActive_ = false;
  wifiLostMs_ = 0;
  g_ntpGotPacket.store(false, std::memory_order_release);
  // Przerwano probe, brak waznego czasu i brak zaplanowanego ponowienia -> zaplanuj
  // jedno (backoff), by zegar w koncu zdobyl czas mimo przerwania (np. zamkniecie WWW).
  if (wasAttempting && retriesLeft_ == 0 && !isSupportedEpoch(time(nullptr))) {
    retriesLeft_ = 1;
    nextRetryMs_ = millis() + backoffMs_;
  }
  WiFi.disconnect(false, false);
  WiFi.mode(WIFI_OFF);
}

bool NtpService::wifiBeginSmart() {
  WiFi.persistent(false);
#if FAST_NTP_RECONNECT
  if (g_persist.wifiHint) { WiFi.begin(ssid_, pass_, g_persist.wifiChannel, g_persist.wifiBssid); return true; }
#endif
  WiFi.begin(ssid_, pass_);
  return false;
}

void NtpService::wifiRetryFullScan() {
#if FAST_NTP_RECONNECT
  g_persist.wifiHint = false;
#endif
  WiFi.disconnect(false, false);
  WiFi.begin(ssid_, pass_);
}

void NtpService::wifiCacheHint() {
#if FAST_NTP_RECONNECT
  if (WiFi.status() == WL_CONNECTED) {
    g_persist.wifiChannel = WiFi.channel();
    const uint8_t *b = WiFi.BSSID();
    if (b) { for (int i = 0; i < 6; i++) g_persist.wifiBssid[i] = b[i]; g_persist.wifiHint = true; }
  }
#endif
}

// Blokujace laczenie WiFi (tylko sciezka panelu WWW; NTP laczy sie nieblokujaco).
bool NtpService::ensureWifi(uint32_t timeoutMs) {
  if (strlen(ssid_) == 0) return false;
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(true);                 // modem-sleep -> mniejszy prad STA
  if (WiFi.status() != WL_CONNECTED) {
    bool usedHint = wifiBeginSmart();
    bool retriedFullScan = false;
    uint32_t start = millis();
    while (WiFi.status() != WL_CONNECTED && millis() - start < timeoutMs) {
      if (usedHint && !retriedFullScan && millis() - start >= WIFI_HINT_FALLBACK_MS) {
        retriedFullScan = true; wifiRetryFullScan();
      }
      delay(100); yield();
      watchdogFeed();                  // blokuje do ~15 s — nie pozwol na falszywy reset
    }
  }
  bool ok = WiFi.status() == WL_CONNECTED;
  if (ok) wifiCacheHint(); else g_persist.wifiHint = false;
  return ok;
}

void NtpService::scheduleRtcWriteRetry(uint8_t retries) {
  rtcWriteRetriesLeft_ = retries;
  rtcWriteNextRetryMs_ = millis() + RTC_WRITE_RETRY_MS;
}

void NtpService::handleRtcWriteRetry() {
  if (rtcWriteRetriesLeft_ == 0 || (int32_t)(millis() - rtcWriteNextRetryMs_) < 0) return;
  if (app_.rtc().writeRtc(time(nullptr), app_.audioActive())) {
    rtcWriteRetriesLeft_ = 0;
    app_.setNtpStatus("NTP OK, RTC OK");
  } else if (--rtcWriteRetriesLeft_ > 0) {
    rtcWriteNextRetryMs_ = millis() + RTC_WRITE_RETRY_MS;
    app_.setNtpStatus("NTP OK, RTC retry");
  } else {
    app_.setNtpStatus("NTP OK, RTC ERR");
  }
  app_.markDirty();
}

void NtpService::finishNtpAttempt(bool ok) {
  bool wasManual = manualAttempt_;
  state_ = NtpSyncState::IDLE;
  manualAttempt_ = false;
  wifiHintActive_ = false;
  wifiLostMs_ = 0;
  stopSntpCallbacks();
  g_ntpGotPacket.store(false, std::memory_order_release);

  if (ok) {
    retriesLeft_ = 0;
    backoffMs_ = NTP_BACKOFF_MIN_MS;          // reset backoffu po sukcesie
  } else if (!wasManual && retriesLeft_ > 0) {
    nextRetryMs_ = millis() + NTP_QUICK_RETRY_MS;     // dokoncz serie szybka
  } else if (!isSupportedEpoch(time(nullptr))) {
    // Brak waznego czasu -> ponawiaj z BACKOFFEM (1 min -> 1 h). Dotyczy takze
    // proby RECZNEJ (manual ustawia retriesLeft_=0): zegar bez czasu nie moze
    // zostac bez zaplanowanego ponowienia tylko dlatego, ze klikniecie zawiodlo.
    retriesLeft_ = 1;
    nextRetryMs_ = millis() + backoffMs_;
    backoffMs_ = (backoffMs_ >= NTP_BACKOFF_MAX_MS / 2) ? NTP_BACKOFF_MAX_MS : backoffMs_ * 2;
  }
  if (!app_.web().isActive()) { WiFi.disconnect(false, false); WiFi.mode(WIFI_OFF); }
  app_.markDirty();
}

void NtpService::beginNtpRequest() {
  g_ntpAcceptPacket.store(false, std::memory_order_release);
  g_ntpGotPacket.store(false, std::memory_order_release);
  sntp_set_time_sync_notification_cb(onSntpSync);   // PRZED configTzTime
  sntp_set_sync_mode(SNTP_SYNC_MODE_IMMED);
  gettimeofday(&fallbackTime_, nullptr);
  g_ntpAcceptPacket.store(true, std::memory_order_release);
  configTzTime(TZ_POLAND, NTP_SERVER_1, NTP_SERVER_2, NTP_SERVER_3);
  state_ = NtpSyncState::WAITING_PACKET;
  wifiLostMs_ = 0;                     // swiezy grace 8 s dla tej proby
  stateStartedMs_ = millis();
  app_.setNtpStatus("oczekiwanie na NTP");
  app_.markDirty();
}

