Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v7.0.ino
void NtpService::syncNtp(bool manual) {
  if (state_ != NtpSyncState::IDLE) return;
  if (manual) retriesLeft_ = 0;
  manualAttempt_ = manual;
  app_.setNtpStatus(manual ? "manual: laczenie WiFi" : "auto: laczenie WiFi");
  app_.markDirty();

  if (strlen(ssid_) == 0) { app_.setNtpStatus("brak SSID WiFi"); finishNtpAttempt(false); return; }

  WiFi.mode(WIFI_STA);
  WiFi.setSleep(true);
  if (WiFi.status() == WL_CONNECTED) {
    beginNtpRequest();
  } else {
    wifiHintActive_ = wifiBeginSmart();
    state_ = NtpSyncState::WIFI_CONNECTING;
    stateStartedMs_ = millis();
  }
}

// Wolane co petle. Zwraca true gdy NTP wlasnie zatwierdzil nowy czas (dla okna budzika).
bool NtpService::service() {
  if (state_ == NtpSyncState::WIFI_CONNECTING) {
    if (WiFi.status() == WL_CONNECTED) {
      wifiCacheHint();
      beginNtpRequest();
    } else if (wifiHintActive_ && millis() - stateStartedMs_ >= WIFI_HINT_FALLBACK_MS) {
      wifiHintActive_ = false;
      app_.setNtpStatus("WiFi: pelny skan");
      wifiRetryFullScan();
      stateStartedMs_ = millis();
      app_.markDirty();
    } else if (millis() - stateStartedMs_ >= NTP_WIFI_TIMEOUT_MS) {
      app_.setNtpStatus("blad WiFi");
      g_persist.wifiHint = false;
      finishNtpAttempt(false);
    }
    return false;
  }

  if (state_ != NtpSyncState::WAITING_PACKET) return false;

  if (g_ntpGotPacket.load(std::memory_order_acquire)) {
    stopSntpCallbacks();                       // zablokuj kolejny pakiet w trakcie zatwierdzania
    time_t syncedEpoch = time(nullptr);
    if (!isSupportedEpoch(syncedEpoch)) {
      restoreTimeAfterFailedNtp();
      app_.setNtpStatus("bledny czas NTP");
      finishNtpAttempt(false);
      return false;
    }
#if ENABLE_RTC_AUTOTRIM
    maybeAutotrimRtc(syncedEpoch);             // pomiar fazowy PRZED nadpisaniem RTC
    syncedEpoch = time(nullptr);               // pomiar mogl potrwac ~1.3 s -> swiezy epoch,
                                               // inaczej writeRtc nie wyrowna fazy
#endif
    struct tm local = {};
    localtime_r(&syncedEpoch, &local);

#if ENABLE_DIAGNOSTICS
    { // Dryft: porownaj STARY czas RTC (jeszcze nienadpisany) z czasem NTP.
      time_t oldRtc;
      if (app_.rtc().readEpoch(&oldRtc)) g_persist.lastRtcDriftSec = (int32_t)(oldRtc - syncedEpoch);
      g_persist.prevNtpSyncEpoch = g_persist.lastNtpSyncEpoch;
      g_persist.lastNtpSyncEpoch = (int64_t)syncedEpoch;
    }
#else
    g_persist.lastNtpSyncEpoch = (int64_t)syncedEpoch;
#endif

    bool rtcOk = app_.rtc().writeRtc(syncedEpoch, app_.audioActive());
    if (rtcOk) rtcWriteRetriesLeft_ = 0; else scheduleRtcWriteRetry();
    char buf[48];
    snprintf(buf, sizeof(buf), "OK %02d:%02d:%02d RTC:%s",
             local.tm_hour, local.tm_min, local.tm_sec, rtcOk ? "OK" : "RETRY");
    app_.setNtpStatus(buf);
    // Znacznik dobowego synchro 18:00 zalicza WYLACZNIE sync w oknie wieczornym
    // (>=18:00, przed noca). Poranne 06:00 ma wlasny znacznik ntpMorningDay.
    if (local.tm_hour >= NTP_HOUR && local.tm_hour < NIGHT_START_HOUR)
      g_persist.ntpStartedDay = localDayKey(local);
    finishNtpAttempt(true);
    return true;
  }

  // Zerwane WiFi w trakcie oczekiwania: pakiet juz nie nadejdzie. Krotki grace
  // (auto-reconnect czesto wraca po chwili), potem szybkie zakonczenie proby
  // zamiast palenia radia do pelnego NTP_PACKET_TIMEOUT_MS (50 s).
  if (WiFi.status() != WL_CONNECTED) {
    if (wifiLostMs_ == 0) {
      wifiLostMs_ = millis();
    } else if (millis() - wifiLostMs_ >= NTP_WIFI_LOST_GRACE_MS) {
      stopSntpCallbacks();
      restoreTimeAfterFailedNtp();
      app_.setNtpStatus("blad NTP (WiFi zerwane)");
      finishNtpAttempt(false);
      return false;
    }
  } else {
    wifiLostMs_ = 0;
  }

  if (millis() - stateStartedMs_ >= NTP_PACKET_TIMEOUT_MS) {
    stopSntpCallbacks();
    restoreTimeAfterFailedNtp();
    app_.setNtpStatus("blad NTP");
    finishNtpAttempt(false);
  }
  return false;
}

bool NtpService::handleNtpRetry() {
  if (state_ != NtpSyncState::IDLE) return true;
  if (retriesLeft_ == 0) return false;
  if ((int32_t)(millis() - nextRetryMs_) < 0) return true;
  --retriesLeft_;
  syncNtp(false);
  return true;
}

#if ENABLE_RTC_AUTOTRIM
// Autokalibracja offsetu: po kazdym pakiecie NTP zmierz dryft fazowo i — gdy
// okno NTP->NTP jest wiarygodne — przesun rejestr 0x02 tak, by wyzerowac ppm.
// Nowy offset trafia do NVS (przezywa utrate zasilania) i dziala od razu.
// Kwantyzacja 4.34 ppm/LSB zostawia dryf resztkowy do ~0.19 s/dobe.
void NtpService::maybeAutotrimRtc(time_t syncedEpoch) {
  if (app_.audioActive()) return;                 // pomiar blokuje ~1.3 s -> nie przy audio
  if (!g_persist.rtcPhaseAligned) return;         // faza startu okna nieznana -> ppm bez sensu
  if (g_persist.lastNtpSyncEpoch <= 0) return;
  int64_t windowSec = (int64_t)syncedEpoch - g_persist.lastNtpSyncEpoch;
  if (windowSec < AUTOTRIM_MIN_WINDOW_SEC || windowSec > AUTOTRIM_MAX_WINDOW_SEC) return;

  int64_t driftUs;
  if (!app_.rtc().measureDriftUs(&driftUs)) return;
  float ppm = (float)driftUs / (float)windowSec;  // us/s = ppm
  g_persist.lastDriftPpm = ppm;
  g_persist.lastDriftWindowSec = (int32_t)windowSec;
  if (fabsf(ppm) > AUTOTRIM_MAX_PLAUSIBLE_PPM) return;   // krysztal tak nie plywa -> zly pomiar

  int target = suggestedTotalOffsetLsb(ppm * PPM_SEC_PER_DAY, app_.rtc().offsetLsb());
  if (target == (int)app_.rtc().offsetLsb()) return;     // korekta ponizej 1 LSB
  if (app_.rtc().applyOffsetLsb((int8_t)target)) {
    g_persist.autotrimAdjustCount++;
    app_.settings().saveRtcOffset((int8_t)target);
    Serial.printf("RTC autotrim: %.2f ppm w %lld s -> offset LSB %d\n",
                  ppm, (long long)windowSec, target);
  }
}
#endif

void NtpService::checkSchedule() {
#if ENABLE_LOW_BATTERY_PROTECT
  // ECO: gdy mamy poprawny czas, NIE budz WiFi do auto-sync (najwiekszy pobor).
  // Pusty RTC -> pozwol sie synchronizowac mimo niskiej baterii (zegar musi miec czas).
  if (app_.battery().isLow() && isSupportedEpoch(time(nullptr))) return;
#endif
  if (handleNtpRetry()) return;
  struct tm t;
  if (!getLocalTm(&t)) return;
  int day = localDayKey(t);
  // Preferowane okno 18:00-18:05; pominiete -> dogon do poczatku nocy. ntpStartedDay
  // gwarantuje DOKLADNIE jeden sync/dobe.
  bool preferredWindow = (t.tm_hour == NTP_HOUR && t.tm_min <= NTP_MIN_WINDOW);
  bool catchupWindow   = (t.tm_hour >= NTP_HOUR && t.tm_hour < NIGHT_START_HOUR);
  if ((preferredWindow || catchupWindow) && g_persist.ntpStartedDay != day) {
    g_persist.ntpStartedDay = day;
    retriesLeft_ = 2;
    syncNtp(false);
  }
}

// ============================================================================
//  DEFINICJE METOD — DisplayManager (U8g2). Rysuje wprost na singletonie 'display'.
// ============================================================================
void DisplayManager::st7305SetStaticLowPower(bool enable) {
#if ST7305_STATIC_LPM
  (void)enable;   // zarezerwowane: HPM/LPM panelu — nieprzetestowana komenda
#else
  (void)enable;
#endif
}

// Ten egzemplarz ST7305 NIE przywraca obrazu po deep-sleep przez sam initInterface()
// -> pelny re-init (reset RST + begin) przy KAZDYM wybudzeniu. W dzien petla uzywa
// light-sleep (setup() sie nie powtarza) -> panel trzyma obraz -> brak mrugania.
void DisplayManager::setup(bool coldBoot) {
  (void)coldBoot;
  pinMode(RLCD_RST_PIN, OUTPUT);
  digitalWrite(RLCD_RST_PIN, HIGH);
  digitalWrite(RLCD_RST_PIN, LOW);
  delay(10);
  digitalWrite(RLCD_RST_PIN, HIGH);
  delay(10);
  // HW SPI: usuwa ~4 s opoznienia pelnego sendBuffer().
  SPI.begin(RLCD_SCK_PIN, -1, RLCD_MOSI_PIN, RLCD_CS_PIN);
  display.setBusClock(2000000UL);      // zalecenie sterownika U8g2 dla ST7305
  display.begin();
  display.setContrast(255);
  st7305SetStaticLowPower(false);
}

void DisplayManager::drawPhotoGlyph(int x, int y, int glyph, bool colon) {
  uint16_t p = colon ? PHOTO_COLON_OFFSET : pgm_read_word(&PHOTO_DIGIT_OFFSET[glyph]);
  for (int row = 0; row < PHOTO_DIGIT_H; row++) {
    uint8_t segs = pgm_read_byte(&PHOTO_FONT_RLE[p++]);
    for (uint8_t i = 0; i < segs; i++) {
      uint8_t start = pgm_read_byte(&PHOTO_FONT_RLE[p++]);
      uint8_t width = pgm_read_byte(&PHOTO_FONT_RLE[p++]);
      display.drawHLine(x + start, y + row, width);
    }
  }
  // Font (Impact) ma skrocona dolna stopke cyfry 4 — uzupelniamy ja tu (latka
  // zwiazana z PHOTO_DIGIT_W/H; zmiana fontu wymaga rewizji tych 2 prostokatow).
  if (!colon && glyph == 4) {
    display.drawBox(x + 39, y + 112, 41, 13);
    display.drawBox(x + 40, y + 125, 31, 25);
  }
}

void DisplayManager::drawLargeTime(uint8_t hour, uint8_t minute, int y) {
  int totalW = PHOTO_DIGIT_W * 4 + PHOTO_COLON_W + PHOTO_DIGIT_GAP * 4;
  int x = (LCD_WIDTH - totalW) / 2 + PHOTO_TIME_X_SHIFT;
  drawPhotoGlyph(x, y, hour / 10, false);   x += PHOTO_DIGIT_W + PHOTO_DIGIT_GAP;
  drawPhotoGlyph(x, y, hour % 10, false);   x += PHOTO_DIGIT_W + PHOTO_DIGIT_GAP;
  drawPhotoGlyph(x + PHOTO_COLON_X_SHIFT, y + PHOTO_COLON_Y_SHIFT, 0, true);
  x += PHOTO_COLON_W + PHOTO_DIGIT_GAP;
  drawPhotoGlyph(x, y, minute / 10, false); x += PHOTO_DIGIT_W + PHOTO_DIGIT_GAP;
  drawPhotoGlyph(x, y, minute % 10, false);
}

void DisplayManager::drawBellIcon(int x, int y, bool active) {
  display.setDrawColor(1);
  display.drawDisc(x + 12, y + 10, 8);
  display.drawBox(x + 5, y + 10, 15, 11);
  display.drawBox(x + 3, y + 20, 19, 4);
  display.drawDisc(x + 12, y + 25, 3);
  display.drawBox(x + 9, y + 3, 7, 4);
  if (!active) {
    display.drawLine(x + 1, y + 26, x + 25, y + 2);
    display.drawLine(x + 2, y + 26, x + 26, y + 2);
  }
}

void DisplayManager::drawBatteryIcon(int x, int y, uint8_t percent) {
  if (percent > 100) percent = 100;
  display.drawFrame(x, y, 28, 13);
  display.drawBox(x + 28, y + 4, 3, 5);
  int fill = map(percent, 0, 100, 0, 24);
  if (fill > 0) display.drawBox(x + 2, y + 2, fill, 9);
  char txt[8];
  snprintf(txt, sizeof(txt), "%u%%", percent);
  display.setFont(u8g2_font_7x14_tf);
  display.drawStr(x - 42, y + 12, txt);
}

void DisplayManager::drawCentered(const char *text, int y) {
  int w = display.getStrWidth(text);
  int x = (LCD_WIDTH - w) / 2;
  if (x < 0) x = 0;
  display.drawStr(x, y, text);
}

// Sygnatura WIDOCZNEJ tresci strony zegara (HH:MM, %aku, budzik, WWW). Pola
// niepokazywane (ntpStatus/statusText) NIE wchodza -> zero pelnych sendBuffer()
// identycznej klatki na panelu refleksyjnym (zero mrugniec).
uint32_t DisplayManager::clockSig(const struct tm &t, int day) {
  uint8_t nh = 0, nm = 0;
  int next = app_.alarm().nextAlarmIndex(&nh, &nm, nullptr, nullptr, 0);
  uint32_t h = 2166136261u;                           // FNV-1a
  auto mix = [&](uint32_t v) { h = (h ^ v) * 16777619u; };
  mix((uint32_t)t.tm_hour);
  mix((uint32_t)t.tm_min);
  mix((uint32_t)day);
  mix((uint32_t)app_.battery().percent());
  mix(app_.web().isActive() ? 1u : 0u);
  mix(app_.alarm().anyEnabled() ? 1u : 0u);
  mix(next >= 0 ? (uint32_t)(nh * 60 + nm + 1) : 0u);
  return h;
}

void DisplayManager::drawClockPage(const struct tm &t) {
  uint8_t nh = 0, nm = 0;
  int next = app_.alarm().nextAlarmIndex(&nh, &nm, nullptr, nullptr, 0);
  bool alarmOn = app_.alarm().anyEnabled();
  uint8_t pct = app_.battery().percent();
  bool webOn = app_.web().isActive();

