Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v7.0.ino
  display.clearBuffer();
  display.setDrawColor(1);
  drawBatteryIcon(360, 8, pct);

  int y = (LCD_HEIGHT - PHOTO_DIGIT_H) / 2 + PHOTO_TIME_Y_SHIFT;
  drawLargeTime(t.tm_hour, t.tm_min, y);

  display.drawHLine(0, 264, LCD_WIDTH);
  drawBellIcon(10, 270, alarmOn);
  display.setFont(u8g2_font_7x14_tf);
  char bottom[80];
  if (next >= 0)
    snprintf(bottom, sizeof(bottom), "Budzik %02u:%02u %s  Aku %u%%  WWW:%s",
             nh, nm, alarmOn ? "ON" : "OFF", pct, webOn ? "ON" : "OFF");
  else
    snprintf(bottom, sizeof(bottom), "Budzik --:-- OFF  Aku %u%%  WWW:%s",
             pct, webOn ? "ON" : "OFF");
  display.drawStr(42, 287, bottom);
  display.sendBuffer();
}

void DisplayManager::drawPreviewPage() {
  uint8_t nh = 0, nm = 0, ns = 0;
  char label[sizeof(app_.alarm().config(0).label)] = "";
  int next = app_.alarm().nextAlarmIndex(&nh, &nm, &ns, label, sizeof(label));

  display.clearBuffer();
  display.setDrawColor(1);
  drawBatteryIcon(360, 8, app_.battery().percent());
  if (next >= 0) {
    drawBellIcon(10, 8, true);
    display.setFont(u8g2_font_9x15_tf);
    drawCentered("NAJBLIZSZY BUDZIK", 25);
    drawLargeTime(nh, nm, 60);
    display.drawHLine(0, 264, LCD_WIDTH);
    char detail[96];
    snprintf(detail, sizeof(detail), "%s  %02u:%02u:%02u  [%s]",
             label, nh, nm, ns, SOUND_NAMES[app_.alarm().config(next).sound % SOUND_COUNT]);
    drawCentered(detail, 287);
  } else {
    drawBellIcon(185, 35, false);
    display.setFont(u8g2_font_logisoso50_tf);
    drawCentered("--:--", 150);
    display.setFont(u8g2_font_9x15_tf);
    drawCentered("Brak aktywnego budzika", 215);
  }
  display.sendBuffer();
  lastClockSig_ = 0xFFFFFFFFu;   // powrot do zegara wymusi repaint
}

void DisplayManager::drawRingingPage() {
  display.clearBuffer();
  display.setDrawColor(1);
  drawBatteryIcon(360, 8, app_.battery().percent());
  drawBellIcon(185, 35, true);
  display.setFont(u8g2_font_logisoso50_tf);
  drawCentered("BUDZIK", 150);
  display.setFont(u8g2_font_9x15_tf);
  drawCentered(app_.statusText().c_str(), 210);
  drawCentered("Przycisk = wycisz", 245);
  display.sendBuffer();
  lastClockSig_ = 0xFFFFFFFFu;
}

void DisplayManager::drawNightPage() {
  display.clearBuffer();
  display.setDrawColor(1);
  display.setFont(u8g2_font_7x14_tf);
  drawCentered("TRYB NOCNY 23:59 - 06:00", 150);
  display.sendBuffer();
  app_.clearDirty();
  lastClockSig_ = 0xFFFFFFFFu;
}

#if ENABLE_LOW_BATTERY_PROTECT
void DisplayManager::drawCriticalBatteryPage() {
  display.clearBuffer();
  display.setDrawColor(1);
  drawBatteryIcon(360, 8, app_.battery().percent());
  display.setFont(u8g2_font_logisoso32_tf);
  drawCentered("ROZLADOWANY", 120);
  display.setFont(u8g2_font_9x15_tf);
  drawCentered("Podlacz ladowarke", 165);
  char b[40];
  snprintf(b, sizeof(b), "%u%%  %.2f V", app_.battery().percent(), app_.battery().voltage());
  drawCentered(b, 200);
  display.sendBuffer();
  lastClockSig_ = 0xFFFFFFFFu;
}
#endif

void DisplayManager::update() {
  if (app_.audioActive()) {                        // stan nadrzedny: dzwoni budzik
    if (app_.dirty()) { drawRingingPage(); app_.clearDirty(); }
    return;
  }
  if (app_.buttons().previewActive()) {            // stan nadrzedny: podglad budzika
    if (app_.buttons().previewWithinWindow()) {
      if (app_.dirty()) { drawPreviewPage(); app_.clearDirty(); }
      return;
    }
    app_.buttons().clearPreview();
    app_.markDirty();
  }

  struct tm t;
  if (!getLocalTm(&t)) {                            // brak czasu
    if (app_.dirty()) {
      display.clearBuffer();
      display.setDrawColor(1);
      display.setFont(u8g2_font_9x15_tf);
      drawCentered("Brak czasu RTC/NTP", 135);
      drawCentered(app_.ntpStatus().c_str(), 170);
      display.sendBuffer();
      app_.clearDirty();
      lastClockSig_ = 0xFFFFFFFFu;
    }
    return;
  }

  // Strona zegara — repaint TYLKO gdy zmienia sie WIDOCZNA tresc (clockSig).
  int day = localDayKey(t);
  uint32_t sig = clockSig(t, day);
  if (sig != lastClockSig_) {
    drawClockPage(t);
    lastDrawMinute_ = t.tm_min; lastDrawDay_ = day; lastClockSig_ = sig;
  }
  app_.clearDirty();
}

// ============================================================================
//  DEFINICJE METOD — WebManager (panel WWW)
// ============================================================================
void WebManager::redirectHome() {
  server.sendHeader("Location", "/");
  server.send(303, "text/plain", "");
}

void WebManager::appendMp3Manager(String &html) {
  html += F("<section><b>Pliki MP3</b>");
  if (!app_.fs().ensureMounted()) { html += F("<p>Brak zamontowanego systemu plikow.</p></section>"); return; }
  html += F("<p class='muted'>System plikow: "); html += htmlEscape(app_.fs().name());
  html += F("</p><form method='post' action='/mp3upload' enctype='multipart/form-data'>"
            "<div class='row'><input type='file' name='mp3' accept='.mp3,audio/mpeg' required>"
            "<button type='submit'>Dodaj / nadpisz MP3</button></div></form>");
  html += F("<table><tr><th>Plik</th><th>Rozmiar</th><th></th></tr>");
  bool any = false;
  File root = app_.fs().fs()->open("/");
  if (root) {
    for (File file = root.openNextFile(); file; file = root.openNextFile()) {
      if (!file.isDirectory()) {
        String path = file.name();
        if (!path.startsWith("/")) path = String("/") + path;
        String lower = path; lower.toLowerCase();
        if (lower.endsWith(".mp3")) {
          any = true;
          html += F("<tr><td>"); html += htmlEscape(path);
          html += F("</td><td>"); html += formatFileSize(file.size());
          html += F("</td><td><form method='post' action='/mp3delete' style='display:inline'>"
                    "<input type='hidden' name='file' value='"); html += htmlEscape(path);
          html += F("'><button type='submit'>Usun</button></form></td></tr>");
        }
      }
      file.close();
    }
    root.close();
  }
  if (!any) html += F("<tr><td colspan='3'>Brak plikow MP3</td></tr>");
  html += F("</table><p class='muted'>Nazwy: litery/cyfry oraz _ - ., maks. 25 znakow; budziki uzywaja /alarm1.mp3, /alarm2.mp3, /alarm3.mp3.</p></section>");
}

void WebManager::pageHeader(String &h) {
  h += F("<!doctype html><html><head><meta charset='utf-8'>"
         "<meta name='viewport' content='width=device-width,initial-scale=1'>"
         "<title>Zegar NTP</title><style>"
         "body{font-family:system-ui,Arial;margin:16px;background:#f5f5f5;color:#111}"
         "main{max-width:760px;margin:auto}section{background:#fff;border:1px solid #ddd;padding:12px;margin:12px 0}"
         "input,button,select{font:inherit;padding:6px;margin:3px}label{display:inline-block;margin:4px 8px 4px 0}"
         "table{width:100%;border-collapse:collapse}td,th{border-bottom:1px solid #ddd;padding:6px;text-align:left}"
         ".row{display:flex;gap:8px;flex-wrap:wrap;align-items:center}.muted{color:#666}"
         "</style></head><body><main><h1>Zegar NTP — 3 budziki</h1>"
         "<p class='muted'>" FW_NAME " v" FW_VERSION " &middot; build " FW_BUILD_DATE " " FW_BUILD_TIME "</p>");
}

void WebManager::handleRoot() {
  untilMs_ = millis() + WEB_WINDOW_MS;
  app_.battery().update(false);   // bez wymuszania: pod WiFi pomiar zanizony, OCV po zamknieciu WWW
  String html; html.reserve(14000);
  pageHeader(html);

  html += F("<section><b>Status</b><p>Czas: "); html += currentTimeText();
  html += F("<br>Budzik: ");     html += htmlEscape(app_.statusText());
  html += F("<br>NTP: ");        html += htmlEscape(app_.ntpStatus());
  html += F("<br>Pliki MP3: ");  html += htmlEscape(app_.fs().name());
  html += F("<br>Akumulator: "); html += app_.battery().percent();
  html += F("% (");              html += String(app_.battery().voltage(), 2);
  html += F(" V, ok. ");         html += String((uint32_t)app_.battery().percent() * BATTERY_CAPACITY_MAH / 100U);
  html += F(" mAh)<br>IP: ");    html += WiFi.localIP().toString();
  {
    float perDay = drainMahPerDay(app_.persist().drain);
    float daysLeft = drainDaysRemaining(app_.persist().drain, app_.battery().percent());
    html += F("<br>Zuzycie: ");
    if (perDay < 0)       html += F("zbieram dane (min ~12 h)");
    else if (perDay == 0) html += F("brak mierzalnego zuzycia");
    else { html += String(perDay, 1); html += F(" mAh/dzien, ~"); html += String(daysLeft, 0); html += F(" dni do rozladowania"); }
  }
  html += F("</p><p><a href='/sync'><button>Synchronizuj NTP</button></a>"
            "<a href='/stop'><button>Stop MP3</button></a>");
#if ENABLE_DIAGNOSTICS
  html += F("<a href='/info'><button>Informacje</button></a>");
#endif
  html += F("<a href='/off'><button>Wylacz panel WWW</button></a>");
  html += F("</p></section>");

  html += F("<form method='post' action='/save'>");
  // Hasla nie renderujemy (panel bez logowania; kazdy w LAN odczytalby je ze zrodla).
  html += F("<section><b>WiFi</b><div class='row'><label>SSID <input name='ssid' value='");
  html += htmlEscape(app_.ntp().ssid());
  html += F("'></label><label>Haslo <input name='pass' type='password' placeholder='(bez zmian)'>"
            "</label></div><p class='muted'>Puste pole hasla = haslo bez zmian.</p></section>");

