Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v7.0.ino
  html += F("<section><b>Budziki</b><table>"
            "<tr><th>Wl.</th><th>Czas</th><th>Glos.</th><th>Dzwiek</th><th>Nazwa</th></tr>");
  for (int i = 0; i < ALARM_COUNT; i++) {
    AlarmConfig &a = app_.alarm().config(i);
    char timeBuf[16];
    snprintf(timeBuf, sizeof(timeBuf), "%02u:%02u:%02u", a.hour, a.minute, a.second);
    html += F("<tr><td><input type='checkbox' name='en"); html += i; html += F("' ");
    if (a.enabled) html += F("checked");
    html += F("></td><td><input type='time' step='1' name='time"); html += i;
    html += F("' value='"); html += timeBuf;
    html += F("'></td><td><input type='number' min='0' max='21' name='vol"); html += i;
    html += F("' value='"); html += a.volume;
    html += F("'></td><td><select name='snd"); html += i; html += F("'>");
    for (int sIdx = 0; sIdx < SOUND_COUNT; sIdx++) {
      html += F("<option value='"); html += sIdx; html += F("'");
      if (a.sound == sIdx) html += F(" selected");
      html += F(">"); html += SOUND_NAMES[sIdx]; html += F("</option>");
    }
    html += F("</select></td><td><input maxlength='15' name='label"); html += i;
    html += F("' value='"); html += htmlEscape(a.label);
    html += F("'></td></tr>");
  }
  html += F("</table><p class='muted'>Dzwiek 1/2/3 = /alarm1.mp3 /alarm2.mp3 /alarm3.mp3.</p></section>");
  html += F("<p><button type='submit'>Zapisz</button></p></form>");

  appendMp3Manager(html);

  html += F("<section><b>Test dzwiekow</b><div class='row'>");
  for (int sIdx = 0; sIdx < SOUND_COUNT; sIdx++) {
    html += F("<form method='post' action='/test' style='display:inline'>"
              "<input type='hidden' name='snd' value='"); html += sIdx;
    html += F("'><button type='submit'>Test "); html += SOUND_NAMES[sIdx]; html += F("</button></form>");
  }
  html += F("</div></section></main></body></html>");
  server.send(200, "text/html", html);
}

void WebManager::handleSave() {
  untilMs_ = millis() + WEB_WINDOW_MS;
  if (server.hasArg("ssid")) { String ssid = server.arg("ssid"); ssid.trim(); app_.ntp().setSsid(ssid); }
  if (server.hasArg("pass") && server.arg("pass").length() > 0) { String pass = server.arg("pass"); app_.ntp().setPass(pass); }

  for (int i = 0; i < ALARM_COUNT; i++) {
    String idx = String(i);
    AlarmConfig &a = app_.alarm().config(i);
    uint8_t prevEnabled = a.enabled;
    uint8_t prevH = a.hour, prevM = a.minute, prevS = a.second;
    a.enabled = server.hasArg(String("en") + idx) ? 1 : 0;
    uint8_t h, m, s;
    if (parseClock(server.arg(String("time") + idx), &h, &m, &s)) { a.hour = h; a.minute = m; a.second = s; }
    bool timeChanged = (a.hour != prevH || a.minute != prevM || a.second != prevS);
    bool reEnabled   = (a.enabled && !prevEnabled);
    if (timeChanged || reEnabled) app_.persist().lastTriggerDay[i] = -1;   // ponowne uzbrojenie: moze odpalic dzis
    String volumeArg = String("vol") + idx, soundArg = String("snd") + idx, labelArg = String("label") + idx;
    if (server.hasArg(volumeArg)) a.volume = constrain(server.arg(volumeArg).toInt(), 0, MAX_AUDIO_VOLUME);
    if (server.hasArg(soundArg))  a.sound  = constrain(server.arg(soundArg).toInt(), 0, SOUND_COUNT - 1);
    if (server.hasArg(labelArg)) {
      String label = server.arg(labelArg); label.trim();
      if (label.length() == 0) label = "Budzik " + String(i + 1);
      label.toCharArray(a.label, sizeof(a.label));
    }
    app_.alarm().sanitize(i);
  }
  app_.settings().save();
  app_.markDirty();
  redirectHome();
}

void WebManager::handleSync() { app_.ntp().syncNtp(true); redirectHome(); }
void WebManager::handleStop() { app_.audio().stopPlayback(true); redirectHome(); }

void WebManager::handleTest() {
  // Nie przerywaj dzwoniacego budzika testem (startSound nie kasuje ringing).
  if (!app_.audio().isRinging()) { uint8_t sIdx = constrain(server.arg("snd").toInt(), 0, SOUND_COUNT - 1); app_.audio().startSound(sIdx, DEFAULT_AUDIO_VOLUME); }
  redirectHome();
}

void WebManager::handleMp3UploadDone() { redirectHome(); }

void WebManager::handleMp3UploadStream() {
  untilMs_ = millis() + WEB_WINDOW_MS;
  watchdogFeed();   // callback per fragment: upload duzego MP3 blokuje loop() minutami
  HTTPUpload &upload = server.upload();
  if (upload.status == UPLOAD_FILE_START) {
    if (mp3UploadFile_) mp3UploadFile_.close();
    mp3UploadAccepted_ = false; mp3UploadHadData_ = false; mp3UploadPath_ = ""; mp3UploadTempPath_ = "";
    if (!normalizeMp3Path(upload.filename, mp3UploadPath_, false)) { app_.setStatus("zla nazwa MP3"); app_.markDirty(); return; }
    if (!app_.fs().ensureMounted()) { app_.setStatus("brak FS dla MP3"); app_.markDirty(); return; }
    if (app_.audioActive()) app_.audio().stopPlayback(true);
    mp3UploadTempPath_ = mp3UploadPath_ + ".part";
    if (app_.fs().fs()->exists(mp3UploadTempPath_)) app_.fs().fs()->remove(mp3UploadTempPath_);
    mp3UploadFile_ = app_.fs().fs()->open(mp3UploadTempPath_, FILE_WRITE);
    mp3UploadAccepted_ = (bool)mp3UploadFile_;
    app_.setStatus(mp3UploadAccepted_ ? String("upload ") + mp3UploadPath_ : "blad zapisu MP3");
    app_.markDirty();
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (mp3UploadAccepted_ && mp3UploadFile_) {
      size_t written = mp3UploadFile_.write(upload.buf, upload.currentSize);
      if (written != upload.currentSize) { mp3UploadAccepted_ = false; app_.setStatus("blad zapisu MP3"); }
      else if (upload.currentSize > 0) mp3UploadHadData_ = true;
    }
  } else if (upload.status == UPLOAD_FILE_END) {
    if (mp3UploadFile_) mp3UploadFile_.close();
    if (mp3UploadAccepted_ && mp3UploadHadData_) {
      String backupPath = mp3UploadPath_ + ".bak";
      if (app_.fs().fs()->exists(backupPath)) app_.fs().fs()->remove(backupPath);
      bool hadOld = app_.fs().fs()->exists(mp3UploadPath_);
      bool oldMoved = !hadOld || app_.fs().fs()->rename(mp3UploadPath_, backupPath);
      bool newInstalled = oldMoved && app_.fs().fs()->rename(mp3UploadTempPath_, mp3UploadPath_);
      if (newInstalled) {
        if (app_.fs().fs()->exists(backupPath)) app_.fs().fs()->remove(backupPath);
        app_.setStatus(String("dodano ") + mp3UploadPath_);
      } else {
        if (oldMoved && hadOld) {
          if (app_.fs().fs()->exists(mp3UploadPath_)) app_.fs().fs()->remove(mp3UploadPath_);
          if (app_.fs().fs()->exists(backupPath)) app_.fs().fs()->rename(backupPath, mp3UploadPath_);
        }
        if (app_.fs().fs()->exists(mp3UploadTempPath_)) app_.fs().fs()->remove(mp3UploadTempPath_);
        app_.setStatus("blad instalacji MP3");
      }
    } else {
      if (mp3UploadTempPath_.length() && app_.fs().fs() && app_.fs().fs()->exists(mp3UploadTempPath_)) app_.fs().fs()->remove(mp3UploadTempPath_);
      if (app_.statusText() == String("upload ") + mp3UploadPath_) app_.setStatus("pusty MP3");
    }
    app_.markDirty();
  } else if (upload.status == UPLOAD_FILE_ABORTED) {
    if (mp3UploadFile_) mp3UploadFile_.close();
    if (mp3UploadTempPath_.length() && app_.fs().fs() && app_.fs().fs()->exists(mp3UploadTempPath_)) app_.fs().fs()->remove(mp3UploadTempPath_);
    app_.setStatus("upload przerwany");
    app_.markDirty();
  }
}

void WebManager::handleMp3Delete() {
  String path;
  if (!normalizeMp3Path(server.arg("file"), path, true)) app_.setStatus("zla nazwa MP3");
  else if (!app_.fs().ensureMounted()) app_.setStatus("brak FS dla MP3");
  else {
    if (app_.audioActive()) app_.audio().stopPlayback(true);
    app_.setStatus((app_.fs().fs()->exists(path) && app_.fs().fs()->remove(path)) ? String("usunieto ") + path : String("brak ") + path);
  }
  app_.markDirty();
  redirectHome();
}

#if ENABLE_DIAGNOSTICS
void WebManager::handleInfo() {
  untilMs_ = millis() + WEB_WINDOW_MS;
  app_.battery().update(false);
  String html; html.reserve(4500);
  pageHeader(html);
  html += F("<section><b>Informacje / diagnostyka</b><table>");
  auto row = [&](const char *k, const String &v) {
    html += F("<tr><td>"); html += k; html += F("</td><td>"); html += htmlEscape(v); html += F("</td></tr>");
  };
  row("Nazwa", FW_NAME);
  row("Wersja", String("v" FW_VERSION));
  row("Kompilacja", String(FW_BUILD_DATE) + " " + FW_BUILD_TIME);
  row("Czas lokalny", currentTimeText());
  {
    long s = app_.ntp().secsSinceLastSync();
    row("Od ostatniego NTP", s < 0 ? String("brak synchronizacji")
        : String(s / 3600) + " h " + String((s % 3600) / 60) + " min");
  }
  row("Przyczyna ostatniego resetu", resetReasonText(esp_reset_reason()));
  row("Rozruchy od zimnego startu", String(app_.persist().bootCount));
  {
    time_t now = time(nullptr);
    if (isSupportedEpoch(now) && app_.persist().coldBootEpoch > 0) {
      long s = (long)(now - (time_t)app_.persist().coldBootEpoch); if (s < 0) s = 0;
      char buf[48];
      snprintf(buf, sizeof(buf), "%ld dni %02ld:%02ld:%02ld", s / 86400, (s % 86400) / 3600, (s % 3600) / 60, s % 60);
      row("Czas pracy (od zimnego startu)", buf);
    } else row("Czas pracy (od zimnego startu)", "ustala sie");
  }
  row("Resety brownout / WDT / panic",
      String(app_.settings().brownoutResets()) + " / " + String(app_.settings().wdtResets()) + " / " + String(app_.settings().panicResets()));
  row("Heap wolny", String(ESP.getFreeHeap()) + " B");
  row("Heap min. od startu", String(ESP.getMinFreeHeap()) + " B");
  row("Heap najwiekszy blok", String(ESP.getMaxAllocHeap()) + " B");
  row("RTC offset (0x02)",
      "0x" + String(app_.rtc().offsetRaw(), HEX) + " (LSB " + String((int)app_.rtc().offsetLsb()) + ", " + String(app_.rtc().offsetPpm(), 1) + " ppm)");
  row("RTC offset status",
      app_.rtc().offsetVerified() ? String("OK (potwierdzony odczytem 0x02)")
        : (app_.rtc().offsetRaw() == 0xFF ? String("BLAD: brak odczytu rejestru 0x02")
             : String("NIEZWERYFIKOWANY: zapis 0x") + String(app_.rtc().targetOffsetRaw(), HEX) + " != odczyt 0x" + String(app_.rtc().offsetRaw(), HEX)));
  if (app_.persist().lastNtpSyncEpoch > 0 && app_.persist().prevNtpSyncEpoch > 0) {
    long  winSec = (long)(app_.persist().lastNtpSyncEpoch - app_.persist().prevNtpSyncEpoch);
    float winH   = winSec / 3600.0f;
    float driftPpm    = winSec > 0 ? (float)app_.persist().lastRtcDriftSec / winSec * 1e6f : 0.0f;
    float driftPerDay = driftPpm * PPM_SEC_PER_DAY;
    float uncPpm      = winSec > 0 ? 1.0f / winSec * 1e6f : 0.0f;
    int   suggest     = suggestedTotalOffsetLsb(driftPerDay, app_.rtc().offsetLsb());
    row("Dryft RTC (ostatni sync)",
        String(app_.persist().lastRtcDriftSec) + " s / " + String(winH, 1) + " h  (" + String(driftPpm, 1) + " +-" +
        String(uncPpm, 1) + " ppm, ~" + String(driftPerDay, 2) + " s/dobe)");
    row("Sugerowany offset RTC",
        "LSB " + String(suggest) + " -> 0x" + String(encodeRtcOffset(suggest, false), HEX) +
        " (z biezacego LSB " + String((int)app_.rtc().offsetLsb()) + ")");
  } else row("Dryft RTC (ostatni sync)", "brak danych (min. 2 synchronizacje)");
#if ENABLE_RTC_AUTOTRIM
  if (app_.persist().lastDriftWindowSec > 0)
    row("Autokalibracja RTC",
        String(app_.persist().lastDriftPpm, 2) + " ppm (pomiar fazowy ~ms, okno " +
        String(app_.persist().lastDriftWindowSec / 3600.0f, 1) + " h), korekt offsetu: " +
        String(app_.persist().autotrimAdjustCount));
  else
    row("Autokalibracja RTC", "czeka na pierwsze pelne okno NTP->NTP (min. 6 h)");
#else
  row("Dryft — rozdzielczosc", "1 s (PCF85063A bez rejestru pod-sekundowego; mierz kilka dob dla < 1 ppm)");
#endif
  row("Akumulator", String(app_.battery().percent()) + "% (" + String(app_.battery().voltage(), 2) + " V)");
#if ENABLE_LOW_BATTERY_PROTECT
  row("Ochrona ogniwa", app_.battery().isCritical() ? "KRYTYCZNY" : (app_.battery().isLow() ? "tryb oszczedny (bez auto-NTP)" : "OK"));
#endif
  if (WiFi.status() == WL_CONNECTED) { row("WiFi", WiFi.SSID() + "  RSSI " + String(WiFi.RSSI()) + " dBm"); row("IP", WiFi.localIP().toString()); }
  else row("WiFi", "rozlaczone");
  row("System plikow", app_.fs().name());
  html += F("</table><p><a href='/'><button>Powrot</button></a></p></section></main></body></html>");
  server.send(200, "text/html", html);
}
#endif

