Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v7.0.ino
// Reczne wylaczenie panelu WWW: odsyla potwierdzenie, a samo zamkniecie wykonuje
// petla PO wyslaniu odpowiedzi (ustawiamy termin okna na "teraz").
void WebManager::handleWebOff() {
  String html; pageHeader(html);
  html += F("<section><b>Panel WWW wylaczony.</b>"
            "<p class='muted'>WiFi zostalo wylaczone dla oszczednosci baterii. "
            "Aby wlaczyc panel ponownie: przytrzymaj przycisk KEY na zegarze.</p>"
            "</section></main></body></html>");
  server.send(200, "text/html", html);
  untilMs_ = millis();   // petla wykryje uplyw okna i zamknie panel po flushu strony
}

void WebManager::installRoutes() {
  server.on("/", HTTP_GET, [this]{ handleRoot(); });
  server.on("/save", HTTP_POST, [this]{ handleSave(); });
  server.on("/sync", HTTP_GET, [this]{ handleSync(); });
  server.on("/stop", HTTP_GET, [this]{ handleStop(); });
  server.on("/test", HTTP_POST, [this]{ handleTest(); });
  server.on("/mp3upload", HTTP_POST, [this]{ handleMp3UploadDone(); }, [this]{ handleMp3UploadStream(); });
  server.on("/mp3delete", HTTP_POST, [this]{ handleMp3Delete(); });
  server.on("/off", HTTP_GET, [this]{ handleWebOff(); });
#if ENABLE_DIAGNOSTICS
  server.on("/info", HTTP_GET, [this]{ handleInfo(); });
#endif
}

bool WebManager::startWebWindow() {
  if (active_) {
    if (WiFi.status() == WL_CONNECTED) { untilMs_ = millis() + WEB_WINDOW_MS; app_.markDirty(); return true; }
    server.stop(); active_ = false;
  }
  if (!app_.ntp().ensureWifi(NTP_WIFI_TIMEOUT_MS)) { app_.setStatus("brak polaczenia WiFi"); app_.ntp().stopWifiAndNtp(); app_.markDirty(); return false; }
  if (!routesInstalled_) { installRoutes(); routesInstalled_ = true; }
  server.begin();
  active_ = true;
  untilMs_ = millis() + WEB_WINDOW_MS;
  app_.markDirty();
  Serial.print("WWW IP: "); Serial.println(WiFi.localIP());
  return true;
}

void WebManager::stopWindow() {
  server.stop();
  active_ = false;
  // Aktywna proba NTP (do ~50 s) sama dokonczy walidacje i wylaczy WiFi.
  if (!app_.ntp().isBusy()) app_.ntp().stopWifiAndNtp();
  app_.markDirty();
}

void WebManager::forceStop() {
  server.stop();
  active_ = false;
}

void WebManager::service() {
  if (WiFi.status() != WL_CONNECTED) {
    // Chwilowy zanik (roaming) nie zamyka okna od razu: auto-reconnect zwykle wraca.
    if (wifiLostMs_ == 0) wifiLostMs_ = millis();
    if (millis() - wifiLostMs_ > WEB_WIFI_GRACE_MS) { wifiLostMs_ = 0; app_.setStatus("WiFi rozlaczone"); stopWindow(); }
  } else {
    wifiLostMs_ = 0;
    server.handleClient();
    if ((int32_t)(millis() - untilMs_) >= 0) stopWindow();
  }
}

// ============================================================================
//  DEFINICJE METOD — PowerManager (tryb nocny / light-sleep / sen ochronny)
// ============================================================================
void PowerManager::releaseNightHolds() {
  gpio_deep_sleep_hold_dis();
  for (auto pin : HOLD_PINS) gpio_hold_dis(pin);
  gpio_hold_dis((gpio_num_t)PA_ENABLE_PIN);
  rtc_gpio_deinit((gpio_num_t)KEY_PIN);
  rtc_gpio_deinit((gpio_num_t)PREVIEW_BUTTON_PIN);
  rtc_gpio_deinit((gpio_num_t)RTC_INT_PIN);
}

void PowerManager::holdNightPins() {
  pinMode(RLCD_RST_PIN, OUTPUT);  digitalWrite(RLCD_RST_PIN, HIGH);
  pinMode(RLCD_CS_PIN, OUTPUT);   digitalWrite(RLCD_CS_PIN, HIGH);
  pinMode(RLCD_DC_PIN, OUTPUT);   digitalWrite(RLCD_DC_PIN, HIGH);
  pinMode(RLCD_SCK_PIN, OUTPUT);  digitalWrite(RLCD_SCK_PIN, LOW);
  pinMode(RLCD_MOSI_PIN, OUTPUT); digitalWrite(RLCD_MOSI_PIN, LOW);
  pinMode(PA_ENABLE_PIN, OUTPUT); digitalWrite(PA_ENABLE_PIN, LOW);
  for (auto pin : HOLD_PINS) gpio_hold_en(pin);
  gpio_hold_en((gpio_num_t)PA_ENABLE_PIN);
  gpio_deep_sleep_hold_en();
}

void PowerManager::shutdownNightPeripherals() {
  if (app_.web().isActive()) app_.web().forceStop();
  app_.ntp().stopWifiAndNtp();
  app_.audio().stopPlayback(true);
  app_.audio().shutdownCodec();
  pinMode(PA_ENABLE_PIN, OUTPUT);
  digitalWrite(PA_ENABLE_PIN, LOW);
}

time_t PowerManager::nightEndEpoch(time_t now) {
  if (!isSupportedEpoch(now)) return 0;
  struct tm t; localtime_r(&now, &t);
  time_t end = epochForClock(t, NIGHT_END_HOUR, NIGHT_END_MIN, 0, 0);
  if (end <= now) end = epochForClock(t, NIGHT_END_HOUR, NIGHT_END_MIN, 0, 1);
  return end;
}

#if ENABLE_LOW_BATTERY_PROTECT
// Ochronny deep-sleep przy krytycznym ogniwie: chroni Li-ion przed glebokim
// rozladowaniem i brownoutem. Budzi sie cyklicznie (timer) sprawdzic ladowanie;
// KEY pozwala wybudzic recznie. Deep-sleep resetuje chip -> setup() ponownie
// zmierzy ogniwo i wznowi prace lub usnie dalej.
void PowerManager::enterCriticalBatterySleepIfNeeded() {
  if (!app_.battery().isCritical()) return;
  if (app_.busy()) return;   // dzwoni budzik / audio / WWW / podglad / aktywny NTP / zapis RTC

  Serial.printf("Akumulator krytyczny (%u%%, %.2f V) -> ochronny sen %lu s\n",
                app_.battery().percent(), app_.battery().voltage(), (unsigned long)BATTERY_CRITICAL_RECHECK_SEC);
  app_.display().drawCriticalBatteryPage();
  delay(150);
  shutdownNightPeripherals();
  setCpuFrequencyMhz(NIGHT_CPU_MHZ);
  watchdogFeed();
  esp_sleep_enable_timer_wakeup((uint64_t)BATTERY_CRITICAL_RECHECK_SEC * 1000000ULL);
  esp_sleep_enable_ext1_wakeup((1ULL << KEY_PIN), ESP_EXT1_WAKEUP_ANY_LOW);
  rtc_gpio_pullup_en((gpio_num_t)KEY_PIN);
  rtc_gpio_pulldown_dis((gpio_num_t)KEY_PIN);
  holdNightPins();
  Serial.flush();
  esp_deep_sleep_start();
}
#endif

// Tryb nocny: deep-sleep do 06:00 / najblizszego budzika. Ekran zgaszony. Budzenie:
// alarm RTC (dokladny) + timer ESP (zabezpieczenie) + przyciski EXT1.
void PowerManager::enterNightSleepIfNeeded(bool force) {
  struct tm t;
  if (!getLocalTm(&t) || !isNightMode(t)) return;
  if (app_.alarm().anyDueNow(t)) return;
  if (!force && (app_.busy() || app_.buttons().wakeHeld())) return;   // utrzymaj wybudzenie po nacisnieciu

  time_t now = time(nullptr);
  time_t wakeAt = nightEndEpoch(now);
  time_t alarmAt = app_.alarm().nextEpoch(t, now);
  if (alarmAt > now && alarmAt < wakeAt) wakeAt = alarmAt;
  if (wakeAt <= now) wakeAt = now + 6 * 60 * 60;
  uint64_t sleepSec = (uint64_t)(wakeAt - now);
  if (sleepSec < NIGHT_MIN_SLEEP_SEC) { sleepSec = NIGHT_MIN_SLEEP_SEC; wakeAt = now + (time_t)sleepSec; }

