Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v7.0.ino
  bool rtcAlarmOk = app_.rtc().setWakeAlarm(wakeAt);
  if (rtcAlarmOk && digitalRead(RTC_INT_PIN) != HIGH) { app_.rtc().disableWakeAlarm(); rtcAlarmOk = false; }
  // Bez dzialajacego alarmu RTC budzi tylko timer ESP na niedokladnym RC: spij w
  // odcinkach, by kazde wybudzenie zakotwiczylo czas z PCF85063A (setup) i dryft
  // pojedynczego odcinka byl << okno wylapania budzika.
  if (!rtcAlarmOk) {
    bool alarmIsNextEvent = (alarmAt > now && wakeAt == alarmAt);
    uint64_t cap = alarmIsNextEvent ? NIGHT_FALLBACK_ALARM_CHUNK_SEC : NIGHT_FALLBACK_CHUNK_SEC;
    if (sleepSec > cap) sleepSec = cap;
  }
  Serial.printf("Tryb nocny: sleep %llu s, RTC alarm: %s\n",
                (unsigned long long)sleepSec, rtcAlarmOk ? "OK" : "ERR");
  app_.display().drawNightPage();
  delay(150);
  shutdownNightPeripherals();
  setCpuFrequencyMhz(NIGHT_CPU_MHZ);
  esp_sleep_enable_timer_wakeup(sleepSec * 1000000ULL);
  uint64_t wakeMask = (1ULL << KEY_PIN) | (1ULL << PREVIEW_BUTTON_PIN);
  if (rtcAlarmOk) wakeMask |= (1ULL << RTC_INT_PIN);
  esp_sleep_enable_ext1_wakeup(wakeMask, ESP_EXT1_WAKEUP_ANY_LOW);
  rtc_gpio_pullup_en((gpio_num_t)KEY_PIN);  rtc_gpio_pulldown_dis((gpio_num_t)KEY_PIN);
  rtc_gpio_pullup_en((gpio_num_t)PREVIEW_BUTTON_PIN); rtc_gpio_pulldown_dis((gpio_num_t)PREVIEW_BUTTON_PIN);
  if (rtcAlarmOk) { rtc_gpio_pullup_en((gpio_num_t)RTC_INT_PIN); rtc_gpio_pulldown_dis((gpio_num_t)RTC_INT_PIN); }
  watchdogFeed();
  holdNightPins();
  Serial.flush();
  esp_deep_sleep_start();
}

// Dynamiczny light-sleep w dzien: spij do granicy nastepnej minuty lub do sekundy
// najblizszego budzika, max 60 s. RLCD trzyma obraz; przyciski wybudzaja przez EXT1.
// Light-sleep NIE rebootuje -> setup() sie nie powtarza -> brak mrugania.
uint64_t PowerManager::computeIdleSleepUs() {
  time_t now = time(nullptr);
  if (!isSupportedEpoch(now)) return IDLE_LIGHT_SLEEP_US;   // czas nieznany -> krotki sen
  struct tm t; localtime_r(&now, &t);
  uint64_t sleepSec = 60 - (uint64_t)t.tm_sec;             // do granicy minuty
  time_t alarmAt = app_.alarm().nextEpoch(t, now);
  if (alarmAt > now) { uint64_t toAlarm = (uint64_t)(alarmAt - now); if (toAlarm < sleepSec) sleepSec = toAlarm; }
  if (sleepSec > IDLE_LIGHT_SLEEP_MAX_SEC) sleepSec = IDLE_LIGHT_SLEEP_MAX_SEC;
  if (sleepSec < 1) sleepSec = 1;
  return sleepSec * 1000000ULL;
}

void PowerManager::idlePowerSave() {
  // Nie usypiaj na dlugo, gdy cos wymaga szybkiej obslugi (App::busy) lub trwa
  // okno utrzymania wybudzenia po nacisnieciu przycisku (Buttons::wakeHeld).
  if (app_.busy() || app_.buttons().wakeHeld()) { delay(5); return; }
  if (digitalRead(KEY_PIN) == LOW || digitalRead(PREVIEW_BUTTON_PIN) == LOW) { delay(5); return; }

  if (app_.audio().codecActive()) app_.audio().shutdownCodec();   // kodek niepotrzebny -> uspij ES8311

  esp_sleep_enable_timer_wakeup(computeIdleSleepUs());
  const uint64_t wakeMask = (1ULL << KEY_PIN) | (1ULL << PREVIEW_BUTTON_PIN);
  esp_err_t extWake = esp_sleep_enable_ext1_wakeup(wakeMask, ESP_EXT1_WAKEUP_ANY_LOW);
#if POWER_DOWN_FLASH_IN_SLEEP
  esp_sleep_pd_config(ESP_PD_DOMAIN_VDDSDIO, ESP_PD_OPTION_OFF);
#endif
  watchdogFeed();
  esp_light_sleep_start();
  watchdogFeed();
  // EXT1 zostawia RTC-hold na padach wybudzajacych — zwolnij od razu, inaczej
  // digitalRead zwraca zatrzasniety stan i przyciski sa martwe do restartu.
  rtc_gpio_hold_dis((gpio_num_t)KEY_PIN);
  rtc_gpio_hold_dis((gpio_num_t)PREVIEW_BUTTON_PIN);
  esp_sleep_wakeup_cause_t wakeCause = esp_sleep_get_wakeup_cause();
  uint64_t wakePins = wakeCause == ESP_SLEEP_WAKEUP_EXT1 ? esp_sleep_get_ext1_wakeup_status() : 0;
  esp_sleep_disable_wakeup_source(ESP_SLEEP_WAKEUP_TIMER);
  if (extWake == ESP_OK) esp_sleep_disable_wakeup_source(ESP_SLEEP_WAKEUP_EXT1);

  // Po light-sleep czas systemowy szedl z mniej dokladnego RTC slow clock —
  // zakotwicz ponownie z PCF85063A, by dryft nie przesuwal zmiany minuty.
  app_.rtc().readToSystem();

  if (wakeCause == ESP_SLEEP_WAKEUP_EXT1) {
    if (wakePins & (1ULL << KEY_PIN))            app_.buttons().primeKeyPressFromWake();
    if (wakePins & (1ULL << PREVIEW_BUTTON_PIN)) app_.buttons().onPreviewWakeFromSleep();
  }
}

// ============================================================================
//  DEFINICJE METOD — Buttons
// ============================================================================
void Buttons::begin() {
  pinMode(KEY_PIN, INPUT_PULLUP);
  pinMode(PREVIEW_BUTTON_PIN, INPUT_PULLUP);
  keyRaw_ = digitalRead(KEY_PIN);  keyStable_ = keyRaw_;  keyChangedMs_ = millis();
  bootRaw_ = digitalRead(PREVIEW_BUTTON_PIN); bootStable_ = bootRaw_; bootChangedMs_ = millis();
}

void Buttons::showPreview() {
  if (app_.audioActive()) return;
  previewActive_ = true;
  previewUntilMs_ = millis() + ALARM_PREVIEW_MS;
  holdWake();
  app_.markDirty();
}

void Buttons::primeKeyPress() {
  keyRaw_ = LOW; keyStable_ = LOW; keyChangedMs_ = millis();
  keyPressMs_ = millis(); keyLongFired_ = false;
}

void Buttons::primeKeyPressFromWake() {
  primeKeyPress();
  holdWake();
}

void Buttons::onPreviewWakeFromSleep() {
  bootRaw_ = LOW; bootStable_ = LOW; bootPressedMs_ = millis(); bootChangedMs_ = millis();
  showPreview();
}

void Buttons::handleKey() {
  bool raw = digitalRead(KEY_PIN);
  if (raw != keyRaw_) { keyRaw_ = raw; keyChangedMs_ = millis(); }
  if (millis() - keyChangedMs_ > BUTTON_DEBOUNCE_MS && raw != keyStable_) {
    keyStable_ = raw;
    if (keyStable_ == LOW) {                         // nacisniety
      keyPressMs_ = millis(); keyLongFired_ = false;
      holdWake();
    } else {                                         // zwolniony — akcja krotka
      if (!keyLongFired_) {                          // krotki KEY: wycisz budzik lub wlacz panel WWW
        if (app_.audioActive()) app_.audio().stopPlayback(true); // dzwoni budzik -> wycisz
        else app_.web().startWebWindow();                        // nie dzwoni -> wlacz panel WWW
      }
      keyPressMs_ = 0;
    }
  }
  // Dlugie przytrzymanie KEY: nic nie robi — ustawiamy tylko keyLongFired, by
  // zwolnienie po dlugim przytrzymaniu NIE wywolalo akcji krotkiej.
  if (keyStable_ == LOW && !keyLongFired_ && keyPressMs_ != 0 &&
      millis() - keyPressMs_ >= WEB_LONG_PRESS_MS) {
    keyLongFired_ = true;
  }
}

void Buttons::handleBoot() {
  bool raw = digitalRead(PREVIEW_BUTTON_PIN);
  if (raw != bootRaw_) { bootRaw_ = raw; bootChangedMs_ = millis(); }
  if (millis() - bootChangedMs_ > BUTTON_DEBOUNCE_MS && raw != bootStable_) {
    bootStable_ = raw;
    if (bootStable_ == LOW) { bootPressedMs_ = millis(); holdWake(); }
    else {
      uint32_t press = millis() - bootPressedMs_;
      if (bootPressedMs_ != 0 && press <= 1200) showPreview();
      bootPressedMs_ = 0;
    }
  }
}

// ============================================================================
//  DEFINICJE METOD — Settings (NVS + diagnostyka resetu)
// ============================================================================
void Settings::load() {
  app_.alarm().setDefaults();
  if (!prefs.begin(NVS_NS, false)) {
    app_.ntp().setCreds(DEFAULT_WIFI_SSID, DEFAULT_WIFI_PASS);
    return;
  }
  if (prefs.getBytesLength("alarms") == app_.alarm().rawSize())
    prefs.getBytes("alarms", app_.alarm().raw(), app_.alarm().rawSize());
  app_.alarm().sanitizeAll();
  String ssid = prefs.getString("ssid", DEFAULT_WIFI_SSID);
  String pass = prefs.getString("pass", DEFAULT_WIFI_PASS);
  if (ssid.length() == 0) { ssid = DEFAULT_WIFI_SSID; pass = DEFAULT_WIFI_PASS; }
  app_.ntp().setCreds(ssid.c_str(), pass.c_str());
#if ENABLE_RTC_AUTOTRIM
  // Wykalibrowany offset przezywa utrate zasilania w NVS; brak klucza = start
  // z fabrycznego RTC_OFFSET_VALUE. Wczytany PRZED ensureOffsetCalibration().
  app_.rtc().setTargetOffsetLsb((int8_t)prefs.getChar("rtcOffLsb", decodeRtcOffset(RTC_OFFSET_VALUE)));
#endif
  prefs.end();
}

