Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v7.0.ino
#if ENABLE_RTC_AUTOTRIM
void Settings::saveRtcOffset(int8_t lsb) {
  if (!prefs.begin(NVS_NS, false)) return;
  prefs.putChar("rtcOffLsb", lsb);
  prefs.end();
}
#endif

void Settings::save() {
  if (!prefs.begin(NVS_NS, false)) return;
  prefs.putBytes("alarms", app_.alarm().raw(), app_.alarm().rawSize());
  prefs.putString("ssid", app_.ntp().ssid());
  prefs.putString("pass", app_.ntp().pass());
  prefs.end();
}

#if ENABLE_DIAGNOSTICS
// Wczytaj dozywotnie liczniki resetow i — jesli ten rozruch to brownout/panic/WDT
// — zwieksz odpowiedni. Zdarzenia rzadkie, wiec zapis do flash bezpieczny.
void Settings::recordResetReason(esp_reset_reason_t r) {
  if (!prefs.begin(NVS_NS, false)) return;
  brownoutResets_ = prefs.getUInt("rstBrown", 0);
  wdtResets_      = prefs.getUInt("rstWdt",   0);
  panicResets_    = prefs.getUInt("rstPanic", 0);
  if (r == ESP_RST_BROWNOUT)                                                   prefs.putUInt("rstBrown", ++brownoutResets_);
  else if (r == ESP_RST_TASK_WDT || r == ESP_RST_INT_WDT || r == ESP_RST_WDT) prefs.putUInt("rstWdt",   ++wdtResets_);
  else if (r == ESP_RST_PANIC)                                                 prefs.putUInt("rstPanic", ++panicResets_);
  prefs.end();
}
#endif

// ============================================================================
//  DEFINICJE METOD — App (orkiestracja setup/loop)
// ============================================================================
void App::setup() {
  // Przyczyne wybudzenia ustalamy NAJPIERW — decyduje o delay(300) (tylko zimny
  // start) oraz o akcji po wybudzeniu.
  esp_sleep_wakeup_cause_t cause = esp_sleep_get_wakeup_cause();
  uint64_t ext1WakePins = (cause == ESP_SLEEP_WAKEUP_EXT1) ? esp_sleep_get_ext1_wakeup_status() : 0;
  bool coldBoot = (cause == ESP_SLEEP_WAKEUP_UNDEFINED);
  bool keyWake = coldBoot || cause == ESP_SLEEP_WAKEUP_EXT0 || ((ext1WakePins & (1ULL << KEY_PIN)) != 0);
  bool previewWake = (ext1WakePins & (1ULL << PREVIEW_BUTTON_PIN)) != 0;
  bool rtcWake = (ext1WakePins & (1ULL << RTC_INT_PIN)) != 0;
  bool userWake = keyWake || previewWake;
  bool scheduledWake = rtcWake || cause == ESP_SLEEP_WAKEUP_TIMER;

  Serial.begin(115200);
  if (coldBoot) delay(300);            // delay tylko na zimnym starcie (USB-CDC)
  setCpuFrequencyMhz(DAY_CPU_MHZ);
  watchdogSetup();
  power().releaseNightHolds();
  pinMode(PA_ENABLE_PIN, OUTPUT);
  digitalWrite(PA_ENABLE_PIN, LOW);
  display().setup(coldBoot);

  if (coldBoot) {                       // RTC RAM przezywa deep-sleep -> zeruj tylko na zimnym starcie
    alarm().resetTriggerState();
    g_persist.ntpStartedDay = -1;
    g_persist.ntpMorningDay = -1;
    g_persist.batteryHasReading = false; g_persist.batteryPercent = 0; g_persist.batteryVoltage = 0.0f;
    g_persist.drain.valid = false;
    g_persist.lastSummaryDay = -1;
    g_persist.wifiHint = false;
    g_persist.bootCount = 0;
    g_persist.coldBootEpoch = 0;
    g_persist.lastRtcDriftSec = 0;
    g_persist.lastNtpSyncEpoch = 0;
    g_persist.prevNtpSyncEpoch = 0;
#if ENABLE_RTC_AUTOTRIM
    g_persist.rtcPhaseAligned = false;
    g_persist.lastDriftPpm = 0.0f;
    g_persist.lastDriftWindowSec = 0;
    g_persist.autotrimAdjustCount = 0;
#endif
  }
  g_persist.bootCount++;

  setenv("TZ", TZ_POLAND, 1);
  tzset();

  pinMode(RTC_INT_PIN, INPUT_PULLUP);
  buttons().begin();

  settings().load();
#if ENABLE_DIAGNOSTICS
  settings().recordResetReason(esp_reset_reason());
#endif
  Serial.printf("\n=== %s v%s  (build %s %s) ===\n", FW_NAME, FW_VERSION, FW_BUILD_DATE, FW_BUILD_TIME);
  Serial.printf("Rozruch #%u, przyczyna resetu: %s\n", g_persist.bootCount, resetReasonText(esp_reset_reason()));
  battery().update(true);

  bool timeFromRtc = rtc().readToSystem();
  rtc().ensureOffsetCalibration();        // kalibracja dryfu (0x02) + odczyt zwrotny
  bool rtcAlarmCleared = rtc().disableWakeAlarm();
  setNtpStatus(timeFromRtc ? "czas z RTC" : "RTC pusty/brak");
  if (rtcWake && !rtcAlarmCleared) setNtpStatus("RTC alarm: blad kasowania");
#if ENABLE_DIAGNOSTICS
  { time_t t0 = time(nullptr);
    if (g_persist.coldBootEpoch == 0 && isSupportedEpoch(t0)) g_persist.coldBootEpoch = (int64_t)t0; }
#endif

  audio().codecPowerDown();               // ES8311 startuje w stanie niskiego poboru

  if (coldBoot) fs().ensureMounted();     // FS tylko do MP3 — montuj leniwie, krotsze wybudzenie
  alarm().checkAlarms(scheduledWake ? NTP_ALARM_CATCHUP_SEC : ALARM_LATE_WINDOW_SEC);
  if (!userWake && !audio().isRinging()) power().enterNightSleepIfNeeded(true);
#if ENABLE_LOW_BATTERY_PROTECT
  if (!userWake && !audio().isRinging()) power().enterCriticalBatterySleepIfNeeded();
#endif

  // WiFi domyslnie OFF. Sync NTP: zimny start, pusty RTC, lub poranne wybudzenie
  // o 06:00 (drugie dobowe synchro obok 18:00). Po zwyklym wybudzeniu wystarcza RTC.
  bool morningSync = false;
  { struct tm t;
    if (getLocalTm(&t) && t.tm_hour == NIGHT_END_HOUR && t.tm_min < NTP_MIN_WINDOW) {
      int day = localDayKey(t);
      if (g_persist.ntpMorningDay != day) { g_persist.ntpMorningDay = day; morningSync = true; }   // raz na dobe
    }
  }
  bool willSync = (coldBoot || !timeFromRtc || morningSync);
  if (!willSync) ntp().stopWifiAndNtp();
  if (userWake) buttons().holdWake();
  if (previewWake) buttons().showPreview();
  if (keyWake && !coldBoot) buttons().primeKeyPress();   // KEY z deep-sleep: zacznij mierzyc nacisniecie
  if (willSync) {
    ntp().setRetries(timeFromRtc ? 2 : 3);   // pusty RTC: kilka szybkich prob, potem backoff
    ntp().syncNtp(false);
  }

  markDirty();
}

void App::loop() {
  watchdogFeed();
  buttons().handleKey();
  buttons().handleBoot();
  power().enterNightSleepIfNeeded(false);

  if (web().isActive()) web().service();

  audio().serviceAudio();
  audio().serviceRinging();
  // Koniec dzwieku w czasie okna WWW/podgladu: idlePowerSave nie biega (busy),
  // wiec uspienie ES8311 i zdjecie podbicia CPU robimy tu — jedno miejsce dla
  // wszystkich sciezek konca odtwarzania. Przerwy miedzy powtorkami budzika
  // chroni audioActive() (ringing_ trzyma true).
  if (audio().codecActive() && !audioActive()) audio().shutdownCodec();
  battery().update(false);
#if ENABLE_LOW_BATTERY_PROTECT
  power().enterCriticalBatterySleepIfNeeded();
#endif
  bool ntpAdjustedTime = ntp().service();
  // Okno spoznienia poszerzone o realny przestoj petli: dlugi handleClient (upload
  // MP3) ani 60 s light-sleep nie moga zgubic budzika z terminem w trakcie przestoju.
  uint32_t loopGapSec = lastAlarmCheckMs_ ? (millis() - lastAlarmCheckMs_) / 1000UL : 0;
  lastAlarmCheckMs_ = millis();
  uint32_t lateWindowSec = ntpAdjustedTime ? NTP_ALARM_CATCHUP_SEC : ALARM_LATE_WINDOW_SEC;
  if (loopGapSec + 2 > lateWindowSec) lateWindowSec = loopGapSec + 2;
  alarm().checkAlarms(lateWindowSec);
  ntp().checkSchedule();
  ntp().handleRtcWriteRetry();
  display().update();
  power().idlePowerSave();
}

// ============================================================================
//  Punkty wejscia Arduino — cala logika w App.
// ============================================================================
void setup() { app.setup(); }
void loop()  { app.loop(); }
